[{"quote":"Not having to own a car has made me realize what a waste of time the automobile is.","author":"Diane Johnson"},{"quote":"Tesla is becoming a real car company.","author":"Elon Musk"},{"quote":"I really think we should pass a law in every state, I don't care whether it takes the independence away from an old person or not. You shouldn't be driving a car if you're over the age of 80. Maybe even less than that.","author":"Evel Knievel"},{"quote":"Google is working on self-driving cars, and they seem to work. People are so bad at driving cars that computers don't have to be that good to be much better.","author":"Marc Andreessen"},{"quote":"The greatest pleasure when I started making money was not buying cars or yachts but finding myself able to have as many freshly typed drafts as possible.","author":"Gore Vidal"},{"quote":"Chrysler builds great cars.","author":"Lee Iacocca"},{"quote":"Your car should drive itself. It's amazing to me that we let humans drive cars... It's a bug that cars were invented before computers.","author":"Eric Schmidt"},{"quote":"I would never kill a living thing, although I probably have inadvertently while driving automobiles.","author":"Captain Beefheart"},{"quote":"A man who has never gone to school may steal from a freight car; but if he has a university education, he may steal the whole railroad.","author":"Theodore Roosevelt"},{"quote":"I miss Saturday morning, rolling out of bed, not shaving, getting into my car with my girls, driving to the supermarket, squeezing the fruit, getting my car washed, taking walks.","author":"Barack Obama"},{"quote":"I'm a crazy car guy. I've got an airplane hangar full of cars.","author":"Paul Walker"},{"quote":"A lot of people think Formula One isn't a sport because everyone drives a car when they go to work in the morning. But we're pulling up to six G on a corner or during breaking, which is almost like being a fighter pilot. So we have to do a lot of work on our neck muscles.","author":"Jenson Button"},{"quote":"Life is a gamble. You can get hurt, but people die in plane crashes, lose their arms and legs in car accidents; people die every day. Same with fighters: some die, some get hurt, some go on. You just don't let yourself believe it will happen to you.","author":"Muhammad Ali"},{"quote":"My first car was a BMW. A white BMW.","author":"Jamie-Lynn Sigler"},{"quote":"Divorced men are more likely to meet their car payments than their child support obligations.","author":"Susan Faludi"},{"quote":"When I was a kid, the only way I saw movies was from the back seat of my family's car at the drive-in.","author":"Forest Whitaker"},{"quote":"We're going to test with the same car, but we have a new car ready.","author":"Larry Dixon"},{"quote":"The old 7 Series, the E38, was an elegant car, an evolution of the classic BMW look. But it wasn't penetrating the luxury market as we desired. It just didn't have the presence to be noticed.","author":"Chris Bangle"},{"quote":"I would make tea for Joni Mitchell or clean her car, anything to be in the studio and watch her work.","author":"Sheena Easton"},{"quote":"My father was a die maker for 39 years, so I had a basic understanding of the automobile industry and what the manufacturing world was like, just from the opportunity to spend time with him - just talking, because he was a car buff.","author":"Mary Barra"},{"quote":"If you saw a dog going to be crushed under a car, wouldn't you help him?","author":"Oskar Schindler"},{"quote":"I wanted to race cars. I didn't like school, and all I wanted to do was work on cars. But right before I graduated, I got into a really bad car accident, and I spent that summer in the hospital thinking about where I was heading. I decided to take education more seriously and go to a community college.","author":"George Lucas"},{"quote":"I'm just disillusioned with the hip-hop sound right now. It's too materialistic. You know, I'm the kind of guy ... I can't do that. If you track my movement, you'll never see a picture of me with any girl that wasn't mine, or my own car. My jewelry, my clothes. What kind of gangsta rapper has a stylist? A stylist?!","author":"Ice T"},{"quote":"I was raised in Chicago and I guess that was one of the special breeding grounds for gangsters of all colors. That was the Detroit of the gangster world. The car industry was thugs.","author":"Quincy Jones"},{"quote":"I had to stop driving my car for a while... the tires got dizzy.","author":"Steven Wright"},{"quote":"There's nothing wrong with the car except that it's on fire.","author":"Murray Walker"},{"quote":"A move to a different town or school gives us new places to explore, new people to meet; a lost pet means we have to organize a careful search; baby-sitting requires looking out for dangers a young child can't foresee; a car crash or fire demands that we get help immediately.","author":"Jim Murphy"},{"quote":"I think fear is what keeps us from going over the edge. I mean, as a race car driver, I don't think what makes a good race car driver is a fearless person. I think it's somebody that is comfortable being behind the wheel of something that's somewhat out of control.","author":"Jeff Gordon"},{"quote":"I remember listening to Miles Davis in the car with my dad. I had just done my Grade 5 piano exam, and I was quite cocky. I said, 'It sounds like he's played the wrong note there.' I remember the look of horror on my dad's face, and thinking, 'Wow, I have to figure out why that is not acceptable.'","author":"Laura Mvula"},{"quote":"I'm not scared of getting hurt. I'm not scared of, pretty much, anything. If you live your life scared, what's the fun in living it? If you were scared of getting hit by a car, would you still cross the street?","author":"Mark Zupan"},{"quote":"If I can sell out clubs and theaters and play dirtbags in movies, and get blown up in a car or get the crap beat out of me in a movie, that's good for me; I'm good.","author":"Bill Burr"},{"quote":"Modern motor vehicles are safer and more reliable than they have ever been - yet more than 1 million people are killed in car accidents around the world each year, and more than 50 million are injured. Why? Largely because one perilous element in the mechanics of driving remains unperfected by progress: the human being.","author":"Tom Chatfield"},{"quote":"I don't have huge bank accounts. I'd love one. But it wouldn't change much. I don't have any expensive habits. I'm not a car collector or any of that nonsense. But I'd love to be incredibly wealthy for no reason at all.","author":"John Lydon"},{"quote":"What a piece of garbage this smart car is. There's a commercial - the smart car has zero percent interest for six years. Well, good, I got zero percent in six years in buying this smart car. I'll tell you that much. I mean, it's ridiculous. My buddy has a smart car, totaled it. He hit a deer tick.","author":"Larry the Cable Guy"},{"quote":"I would wear the blue overalls of the fieldworker and often wore round, rimless glasses known as Mazzawati teaglasses. I had a car, and I wore a chauffeur's cap with my overalls. The pose of chauffeur was convenient because I could travel under the pretext of driving my master's car.","author":"Nelson Mandela"},{"quote":"I was in prison for a charge in Texas, murder one. Back in the '70s in Texas, I was there. I heard the shot. I was in the car.","author":"Duane Chapman"},{"quote":"If any demonstrator ever lays down in front of my car, it'll be the last car he'll ever lay down in front of.","author":"George C. Wallace"},{"quote":"The fact is I don't drive just to get from A to B. I enjoy feeling the car's reactions, becoming part of it.","author":"Enzo Ferrari"},{"quote":"I want a car that will last 10 years or longer because I totally hate the process of researching, shopping for a new car, and then haggling for the price. I wish I could just snap my fingers and my car is there.","author":"Kiran Ahluwalia"},{"quote":"The biggest thrill a ballplayer can have is when your son takes after you. That happened when my Bobby was in his championship Little League game. He really showed me something. Struck out three times. Made an error that lost the game. Parents were throwing things at our car and swearing at us as we drove off. Gosh, I was proud.","author":"Bob Uecker"},{"quote":"I'm a car fanatic and each morning I wake up with a smile on my face, whether I'm commentating on the Formula One or at Silver Hatch racetrack in Roary the Racing Car.","author":"Murray Walker"},{"quote":"I rememeber one time we were getting ready to go to South America and everything was packed up and in the car ready to go and I hid and I was crying because I really did not want to go, I wanted to play. I did not want to go.","author":"Michael Jackson"},{"quote":"When you're in a race car, you're going through so many different emotions throughout that race.","author":"Jeff Gordon"},{"quote":"Whither goest thou, America, in thy shiny car in the night?","author":"Jack Kerouac"},{"quote":"Every song has a composer, every book has an author, every car has a maker, every painting has a painter, and every building has a builder. So it isn't irrational to take this simple logic a little further and say that nature must have had a Maker. It would be irrational to believe that it made itself.","author":"Ray Comfort"},{"quote":"The culture is going into a psychological depression. We are concerned about our place in the world, about being competitive: Will my children have as much as I have? Will I ever own my own home? How can I pay for a new car? Are immigrants taking away my white world?","author":"James Hillman"},{"quote":"I keep my weight low, although you need to be able to move your weight around the race car to change the balance. I'm 6ft and I'm 70kg so I haven't much fat on me.","author":"Jenson Button"},{"quote":"Can you design a Rorschach test that's going to make everyone feel something every time - and that looks like a Rorschach test? It's easy to show a picture of a kitten or a car accident. The question is, how abstract can you get and still get the audience to feel something when they don't know what's happening to them?","author":"Jason Reitman"},{"quote":"I think the true test of a pop song, for me, and I've talked to a lot of other writers about this, is you take your demo, you pop it in your car and you drive down Sunset Blvd. to Santa Monica, and that's the Hollywood car test.","author":"Ryan Tedder"},{"quote":"I was raised by my grandparents, and they always made sure that I had a pencil and some paper, whether we were in the car or at a restaurant. While they were enjoying a nice meal, I would be sitting there drawing funny pictures of the waitress.","author":"Jarrett J. Krosoczka"},{"quote":"For Nirvana, putting out their first major-label record was like getting into a new car. But the runaway success was like suddenly discovering that the car was a Ferrari and the accelerator pedal was Krazy Glued to the floorboard.","author":"Michael Azerrad"},{"quote":"In Brussels, you are able to have a lot of appointments in a day. In Paris, you can have one, two, maybe three, but you spend all your time on the road, in the car or in the suburbs. In Brussels, everything is easy. It's not a very big city, and the people are very quiet and warm.","author":"Eric-Emmanuel Schmitt"},{"quote":"No illusion is more crucial than the illusion that great success and huge money buy you immunity from the common ills of mankind, such as cars that won't start.","author":"Larry McMurtry"},{"quote":"Back in the mid-1970s, we adopted some fairly ambitious goals to improve efficiency of our cars. What did we get? We got a tremendous boost in efficiency.","author":"Jay Inslee"},{"quote":"Parisians overwhelmingly buy small cars. And it's not because people are petite, but because fuel is drop-dead expensive. Gasoline costs more than twice as much in Paris as in New York.","author":"Serge Schmemann"},{"quote":"In Japan, they have TV sets in cars right now, where you can punch up traffic routes, weather, everything! You can get Internet access already in cars in Japan, so within the next 2 to 3 years it's gonna be so crazy!","author":"Glenn Danzig"},{"quote":"A car for every purse and purpose.","author":"Alfred P. Sloan"},{"quote":"Self-driving cars are the natural extension of active safety and obviously something we should do.","author":"Elon Musk"},{"quote":"Electric cars aren't pollution-free; they have to get their energy from somewhere.","author":"Alexandra Paul"},{"quote":"My opinion is it's a bridge too far to go to fully autonomous cars.","author":"Elon Musk"},{"quote":"I'm glad to see that BMW is bringing an electric car to market. That's cool.","author":"Elon Musk"},{"quote":"I love everything from old-school cars to whatever the latest muscle or luxury vehicles are.","author":"Ludacris"},{"quote":"Auto racing is boring except when a car is going at least 172 miles per hour upside down.","author":"Dave Barry"},{"quote":"I wish people would spend their money on hybrid cars.","author":"Ryan Tedder"},{"quote":"In less enlightened times, the best way to impress women was to own a hot car. But women wised up and realized it was better to buy their own hot cars so they wouldn't have to ride around with jerks.","author":"Scott Adams"},{"quote":"The car has become the carapace, the protective and aggressive shell, of urban and suburban man.","author":"Marshall McLuhan"},{"quote":"Remote villages and communities have lost their identity, and their peace and charm have been sacrificed to that worst of abominations, the automobile.","author":"James Norman Hall"},{"quote":"I've always been attracted to cars, and driving is a completely measurable experience: if you qualify last on the grid, you're the slowest, and if you qualify first on the grid, you're the fastest. So no one can say you're slow if you're fast and no one can say you're fast if you're slow.","author":"Eric Bana"},{"quote":"Well, I always had a chauffer, because I have never driven a car in my life. I still can't drive.","author":"Bud Abbott"},{"quote":"Drive-in banks were established so most of the cars today could see their real owners.","author":"E. Joseph Cossman"},{"quote":"We approach people the same way we approach our cars. We take the poor kid to a doctor and ask, What's wrong with him, how much will it cost, and when can I pick him up?","author":"James Hillman"},{"quote":"But to personally satisfy my own adrenalin needs, I've been racing cars a little bit, which has been fun.","author":"Picabo Street"},{"quote":"Car designers are just going to have to come up with an automobile that outlasts the payments.","author":"Erma Bombeck"},{"quote":"My boyfriend keeps telling me I've got to own things. So, first I bought this car. And then he told me I oughta get a house. 'Why a house?' 'Well, you gotta have a place to park the car.'","author":"Julia Roberts"},{"quote":"I drive Fords, and I've driven American cars all my life, and I want to have a strong American manufacturing sector, especially in automobiles.","author":"Jim DeMint"},{"quote":"Consider what kind of car you get. Buy cars and other products that have the least impact environmentally.","author":"Al Gore"},{"quote":"Richard Childress and myself have made some important innovations on our cars.","author":"Dale Earnhardt"},{"quote":"Ikea people do not drive flashy cars or stay at luxury hotels.","author":"Ingvar Kamprad"},{"quote":"I was hit by a car once on my bike, but I still rode home.","author":"Amy Winehouse"},{"quote":"I hate the hand that comes out of a car and just drops litter in the street. I hate that! For some reason, it just fills me with fury! It's just utter laziness, lack of interest in other people, lack of interest in the planet, in the hedgehog who might eat the plastic bag, it's a lack of concern.","author":"Joanna Lumley"},{"quote":"The newly decorated theatres produced things like car parks and restaurants, so you could have a good night out, quite cheaply without all that bother of having to go somewhere else.","author":"Timothy West"},{"quote":"I take cabs if I need to get somewhere or I take car service. I don't drive, I wouldn't mind riding a bike... People think that because you become an entertainer you gotta have this rock star thug image. I'm an artist, man. I'm going to live like an artist.","author":"ASAP Rocky"},{"quote":"It's very hard for me to get a new car. It's really hard for me to get a new house. It's really hard for me to move on from the things that give me stability.","author":"Jodie Foster"},{"quote":"I sing both in my shower and in my car, mostly in my car, because I have this weird thing - whenever I'm singing to the radio - my friends kind of hate it - but I pick out the harmonies in my head, and I'm singing the harmonies to the tracks and I'm jamming it out.","author":"Paul McDonald"},{"quote":"When I was 19 years old, both of my parents died in the same year; my mom of cancer and my dad in a car accident. Through the next two or three years and a series of bad decisions - all my own, I might add - I ended up literally homeless, before that was even a word. I even slept occasionally under a pier on the Gulf Coast.","author":"Andy Andrews"},{"quote":"Just as your car runs more smoothly and requires less energy to go faster and farther when the wheels are in perfect alignment, you perform better when your thoughts, feelings, emotions, goals, and values are in balance.","author":"Brian Tracy"},{"quote":"In the past there were people who were not rich but contented with their living style, laughing and happy all day. But when the new rich people appear, people look at them and ask, 'why don't I have a life like that too, a beautiful house, car and garden,' and they abandon their values.","author":"Thich Nhat Hanh"},{"quote":"One of the things that's interesting to me is I find things like caffeine and stunts actually relax me. When they're putting a bit of gel on my arm and lighting me on fire, or when I'm about to go into a high-speed car chase or rev a motorcycle up pretty fast, I find everything else around me slows down.","author":"Nicolas Cage"},{"quote":"Spending $1 for a brand new house would feel very, very good. Spending $1,000 for a ham sandwich would feel very, very bad. Spending $19,000 for a small family car would feel, well, more or less right. But as with physical pain, fiscal pain can depend on the individual, and everyone has a different threshold.","author":"Jeffrey Kluger"},{"quote":"Faith is the substance of hope - of things hoped for and the evidence of things not seen. So if you can hope for it and imagine it, and keep imagining and hoping and seeing yourself driving a new car, or seeing yourself getting that job, or seeing yourself excel, seeing yourself help that person - that is faith.","author":"Duane Chapman"},{"quote":"A lot of the songs start with an image. I was sitting there playing the guitar and I pictured this old, dirty green car, with the window rolled down, in the hot, hot, hot Texas heat, and this beautiful woman I knew when I was a kid sitting behind the wheel, looking out at me.","author":"Edie Brickell"},{"quote":"The negative effects of combat were nightmares, and I'd get jumpy around certain noises and stuff, but you'd have that after a car accident or a bad divorce. Life's filled with trauma. You don't need to go to war to find it; it's going to find you. We all deal with it, and the effects go away after awhile. At least they did for me.","author":"Sebastian Junger"},{"quote":"A muscle is like a car. If you want it to run well early in the morning, you have to warm it up.","author":"Florence Griffith Joyner"},{"quote":"I don't want to die in a car accident. When I die it'll be a glorious day. It'll probably be a waterfall.","author":"River Phoenix"},{"quote":"I am a racer. I'm not a race car driver. I am a racer. I race. That's what I do. I don't go on vacations. I don't take my family on vacations because I don't have a family. My family is the racing family.","author":"Tony Stewart"},{"quote":"My mother is a big believer in being responsible for your own happiness. She always talked about finding joy in small moments and insisted that we stop and take in the beauty of an ordinary day. When I stop the car to make my kids really see a sunset, I hear my mother's voice and smile.","author":"Jennifer Garner"},{"quote":"My dad took me out to see a meteor shower when I was a little kid, and it was scary for me because he woke me up in the middle of the night. My heart was beating; I didn't know what he wanted to do. He wouldn't tell me, and he put me in the car and we went off, and I saw all these people lying on blankets, looking up at the sky.","author":"Steven Spielberg"},{"quote":"I hate when someone drives my car and resets all the radio presets. I don't understand it. If I was ever driving someone's car, I would never touch the things that were set.","author":"Will Ferrell"},{"quote":"I have two or three cars that I like, but today, Ferrari would be the best car I have driven in terms of being an impressive car.","author":"Ratan Tata"},{"quote":"When you were growing up, your mom and dad told you to look both ways before crossing the street or not to get into a car with a stranger. It's the same with the Internet. We have a big responsibility and a huge role in bringing all the stakeholders to the table - users, parents, educators, law enforcement, government organisations.","author":"Chris DeWolfe"},{"quote":"Going to church doesn't make you any more a Christian than going to the garage makes you a car.","author":"Laurence J. Peter"},{"quote":"When you get into your car, shut the door and be there for just half a minute. Breathe, feel the energy inside your body, look around at the sky, the trees. The mind might tell you, 'I don't have time.' But that's the mind talking to you. Even the busiest person has time for 30 seconds of space.","author":"Eckhart Tolle"},{"quote":"John D. Rockefeller wanted to dominate oil, but Microsoft wants it all, you name it: cable, media, banking, car dealerships.","author":"Ralph Nader"},{"quote":"I grew up in Oklahoma and Missouri, and I just loved film. My folks would take us to the drive-in on summer nights, and we'd sit on the hood of the car. I just had this profound love for storytelling.","author":"Brad Pitt"},{"quote":"When I leave the car park at Melwood, I try and become a completely different person. I try to get away from it. You have got to. Otherwise you end up like Jamie Carragher - obsessed!","author":"Steven Gerrard"},{"quote":"I will sit in the car on the way to a meeting and just smile. I really mean that. It helps you get through life. If you have nothing to say, smile. Look up at the sky and smile. Just be grateful.","author":"Andre Leon Talley"},{"quote":"I've done movies I'm very proud of, but there's always a sense of: 'Come see this shiny new car!' The question I hate the most is: 'Why should people see it?'","author":"Oscar Isaac"},{"quote":"I think, aesthetically, car design is so interesting - the dashboards, the steering wheels, and the beauty of the mechanics. I don't know how any of it works, I don't want to know, but it's inspirational.","author":"Paloma Picasso"},{"quote":"When you read about a car crash in which two or three youngsters are killed, do you pause to dwell on the amount of love and treasure and patience parents poured into bodies no longer suitable for open caskets?","author":"Jim Bishop"},{"quote":"A new car is not going to change your life.","author":"Monica Ali"},{"quote":"I compare it to being in a car accident. There's so much adrenaline rushing through you that you remember being in the accident but you don't remember any of the details.","author":"Brooke Langton"},{"quote":"The reason I moved to California the first time was to build the Cobra. I thought it was stupid to have a 1918 taxicab engine in what Europeans like to call a performance car when a little American V-8 could do the job better.","author":"Carroll Shelby"},{"quote":"My dad used to love Steely Dan, the Stones, Jethro Tull and all that. There was always Steely Dan going in my dad's car, but I remember The Royal Scam in particular because it has 'Kid Charlemagne' on it.","author":"St. Vincent"},{"quote":"Investors have few spare tires left. Think of the image of a car on a bumpy road to an uncertain destination that has already used up its spare tire. The cash reserves of people have been eaten up by the recent market volatility.","author":"Mohamed El-Erian"},{"quote":"I remember my father's last race very clearly when he drove at Hockenheim in front of 100,000 people and I was sitting next to him on the roof of his car and waving to the fans. That was the moment when I thought: 'One day I want to do the same.'","author":"Nico Rosberg"},{"quote":"I think it's particularly a distinctively American concept that resonates with American culture through biker culture. A motorcycle is an independent thing. You're like, 'I don't want to ride in a car with this person. I want to be independent and ride by myself. But, let's ride in a group. Let's be independent, together.'","author":"Ryan Hurst"},{"quote":"Nothing's ever too fast. Maybe sometimes on the road some people are too fast if they don't know how to control the car, but in racing, the faster and more power and grip, the better it is.","author":"Heikki Kovalainen"},{"quote":"Stone Mountain, Georgia, still had Ku Klux Klan marches, and I had a wild and courageous mother who'd put us in the car to watch them. She wanted us to know those things existed.","author":"Nicole Beharie"},{"quote":"I lost my brother in a car wreck when I was 14 years old. When I decided I wanted to be a country singer, my dad always told me, 'Son, you should write a song about your brother.'","author":"Blake Shelton"},{"quote":"The Internet of Things tell us that a lot of computer-enabled appliances and devices are going to become part of this system, too: appliances that you use around the house, that you use in your office, that you carry around with yourself or in the car. That's the Internet of Things that's coming.","author":"Vint Cerf"},{"quote":"My definition of a redundancy is an air-bag in a politician's car.","author":"Larry Hagman"},{"quote":"Man, coaching is a hard job, and it requires a lot of time... I hear stories from coaches who tell me that players call them in the middle of the night not knowing where they parked their car.","author":"Joe Montana"},{"quote":"You were not in control You had no visibility: maybe there was a car in front of you, maybe not.","author":"Alain Prost"},{"quote":"I'm more into, like, colour than, like, the type of car and stuff. I don't know much about cars, so I'm just more into picking the right color.","author":"Miranda Cosgrove"},{"quote":"In America, people buy cars, and they put very little money down. They get a car, and they go to work. The work pays them a salary; the salary allows them to pay for the car over time. The car pays for itself.","author":"Iqbal Quadir"},{"quote":"I've been in a car three or four times when it filled with water and it's not a comfortable feeling.","author":"Richard Hammond"},{"quote":"I have a Volvo S60R and it's a pretty fast car, the R says it all.","author":"Josie Maran"},{"quote":"In the United States three new methods of transportation made their appearance at almost the same time - the steamboat, the canal boat, and the rail car.","author":"John Moody"},{"quote":"I spent a disproportionate amount of my time in a car in L.A. I'm 35 years old. If you add up the hours spent in cars, it would be years.","author":"Travis Kalanick"},{"quote":"Making a new car is so expensive that the risk factor is what takes the unique ideas and keeps reanalyzing them until they become very similar.","author":"Charles Pelly"},{"quote":"I know a lot about cars, man. I can look at any car's headlights and tell you exactly which way it's coming.","author":"Mitch Hedberg"},{"quote":"The cars we drive say a lot about us.","author":"Alexandra Paul"},{"quote":"Cars and cameras are the two things I let myself be materialistic about. I don't care about other stuff.","author":"Louis C. K."},{"quote":"We often attribute 'understanding' and other cognitive predicates by metaphor and analogy to cars, adding machines, and other artifacts, but nothing is proved by such attributions.","author":"John Searle"},{"quote":"I love fast cars... and to go too fast in them.","author":"Lara Flynn Boyle"},{"quote":"Perhaps people, and kids especially, are spoiled today, because all the kids today have cars, it seems. When I was young you were lucky to have a bike.","author":"James Cagney"},{"quote":"If GM had kept up with technology like the computer industry has, we would all be driving $25 cars that got 1,000 MPG.","author":"Bill Gates"},{"quote":"I've actually made a prediction that within 30 years a majority of new cars made in the United States will be electric. And I don't mean hybrid, I mean fully electric.","author":"Elon Musk"},{"quote":"My dad was very successful running midgets in Texas. Then, his two drivers ran into some bad luck. People started saying that Daddy had lost his touch. That it was the cars and not the drivers. I wanted to race just to prove all those people wrong.","author":"A. J. Foyt"},{"quote":"No action hero is more closely associated with cars than James Bond.","author":"Richard Hammond"},{"quote":"You talk about German technocracy and you get automobiles.","author":"Gordon Sinclair"},{"quote":"The years I raced in were fantastic. There was so much change in the cars. We went from treaded tyres to no wings right through to slicks to enormous wings.","author":"Jackie Stewart"},{"quote":"I replaced the headlights in my car with strobe lights, so it looks like I'm the only one moving.","author":"Steven Wright"},{"quote":"Societies need rules that make no sense for individuals. For example, it makes no difference whether a single car drives on the left or on the right. But it makes all the difference when there are many cars!","author":"Marvin Minsky"},{"quote":"I spent a lot of money on booze, birds and fast cars. The rest I just squandered.","author":"George Best"},{"quote":"Everything in life is somewhere else, and you get there in a car.","author":"E. B. White"},{"quote":"I love driving cars, looking at them, cleaning and washing and shining them. I clean 'em inside and outside. I'm very touchy about cars. I don't want anybody leaning on them or closing the door too hard, know what I mean?","author":"Scott Baio"},{"quote":"It's like driving a car at night. You never see further than your headlights, but you can make the whole trip that way.","author":"E. L. Doctorow"},{"quote":"I hooked up my accelerator pedal in my car to my brake lights. I hit the gas, people behind me stop, and I'm gone.","author":"Steven Wright"},{"quote":"Fast cars are my only vice.","author":"Michael Bay"},{"quote":"Family trips to Yellowstone and to what are now national parks in Southern Utah, driving the primitive roads and cars of that day, were real adventures.","author":"Paul D. Boyer"},{"quote":"In the history of the world, no one has ever washed a rented car.","author":"Lawrence Summers"},{"quote":"If all the cars in the United States were placed end to end, it would probably be Labor Day Weekend.","author":"Doug Larson"},{"quote":"The best car safety device is a rear-view mirror with a cop in it.","author":"Dudley Moore"},{"quote":"The automobile engine will come, and then I will consider my life's work complete.","author":"Rudolf Diesel"},{"quote":"It's a never ending battle of making your cars better and also trying to be better yourself.","author":"Dale Earnhardt"},{"quote":"By the time the children go to bed, I am as drained as any mother who has spent her day working, car pooling, building Lego castles and shopping for the precisely correct soccer cleat.","author":"Ayelet Waldman"},{"quote":"Everybody has a gun in their car in Detroit.","author":"Jim Harrison"},{"quote":"I think we're getting to the point where everyone's getting fat and everyone's getting allergic, or claims to be allergic to something and people can't walk from their front door to their car without a bottle of water in their hand because they have to hydrate every three and half steps.","author":"Adam Carolla"},{"quote":"It makes me happy that people recognise me and want to click pictures with me. But sometimes, I want to be a common person. I want to go to a coffee shop and just chill. I miss driving my car with the windows rolled down.","author":"Sonam Kapoor"},{"quote":"Get in the race car do what I do then go home. We don't have freedom to do anything anymore.","author":"Tony Stewart"},{"quote":"I wasn't one to go out and buy a new car and stereo system and expensive clothes. My mom helped keep me grounded.","author":"Christina Applegate"},{"quote":"I'm not gonna ride home in the car. I'll wait for Randy. I think I'll get home quicker.","author":"Patsy Cline"},{"quote":"I used to have this Mercedes, a dark blue 450SLC, which was the most beautiful car. I'd like to have another unusual, beautiful car.","author":"Andrew Davies"},{"quote":"I quit after a bad car accident. The thing about boxing is that you can be a star for five or six years, but when you go back to the old life, it's tough.","author":"Olivier Martinez"},{"quote":"The percentage you're paying is too high priced While you're living beyond all your means And the man in the suit has just bought a new car From the profit he's made on your dreams.","author":"Steve Winwood"},{"quote":"I'm not a car guy. The subway gets me where I need to go efficiently and cheaply, and I don't worry about traffic.","author":"Joe Scarborough"},{"quote":"I always thought it would be a great thing to do an art carwash. So you can actually go and get your car washed, but while you're sitting around waiting you can walk in that hallway where you look at the cars going through the window, and that could be changing exhibitions.","author":"Kenny Scharf"},{"quote":"I was an economics major in college, and every summer after school, I would drive my car from California, from Claremont men's college at the time, to New York. And I worked on Wall Street.","author":"Henry Kravis"},{"quote":"I've never wanted to drive a car fast for the sake of it. I mean, I like nice cars. I've got the Bentley, I've had a Lotus, I've had a Rolls-Royce and a few Jaguars, including an E-type. But I'm not somebody for driving tremendously fast.","author":"Terry Wogan"},{"quote":"Switching over to a hybrid car is one of those right things, but, unfairly or not, it still has a reputation among car enthusiasts as something you have to pedal really fast when you're on the ramp merging into traffic on the 401.","author":"Linwood Barclay"},{"quote":"You don't have to carry a designer bag that costs more than a car to look cool.","author":"Kesha"},{"quote":"One of the first things a British visitor to Southern California discovers is that he must have a car. Freeways. Bad public transport. I took driving lessons.","author":"Christopher Lee"},{"quote":"Never lend your car to anyone to whom you have given birth.","author":"Erma Bombeck"},{"quote":"To this day, I am the least materialistic person I know, because my father didn't raise me to just go out and buy this or that car. The only reason I wanted to make money as an actor was because I'm passionate about food!","author":"Hugh Jackman"},{"quote":"I remember Detroit feeling really unsafe, feeling scared a lot. Our house was broken into, our car was stolen, we had to get a watchdog, we would get beat up in the street, I had my bike stolen. There was just a lot of real anarchy on the streets and sidewalks.","author":"Sufjan Stevens"},{"quote":"Two of my grandparents died in a car crash. Sucks, 'cause they would have lived to a hundred.","author":"Kid Rock"},{"quote":"We don't sell a car, we sell a dream. We are Italy's national team. There are many great soccer teams in our country, but there is only one Ferrari.","author":"Luca Cordero di Montezemolo"},{"quote":"Campaign behavior for wives: Always be on time. Do as little talking as humanly possible. Lean back in the parade car so everybody can see the president.","author":"Eleanor Roosevelt"},{"quote":"If a neighbor is killed in a car accident, do you sell your car and stop driving?","author":"Mario Andretti"},{"quote":"People think getting a new partner is like getting a new car.","author":"Orlando Bloom"},{"quote":"I want to let my friend Buster know that I would like to have dinner with him tonight. Does Buster work at home? Then how likely is he to have his cell phone on? Is he one of those people who only turns on his cell when he's in his car? I hate that.","author":"Susan Orlean"},{"quote":"My most memorable recognition story was in Venice, Italy. My fiance and I were renting a car, and I was recognized by the person standing behind me by my voice. I thought that was hysterical!","author":"Erica Cerra"},{"quote":"The city needs a car like a fish needs a bicycle.","author":"Dean Kamen"},{"quote":"We have to change public perception of ex-convicts. Most Canadians don't realize that when you come out of prison, you're a complete pariah. You can't get a car loan or money from a bank to start a business. So most end up back in prison within 24 months. It's just so wrong. We need to fix this problem.","author":"Kevin O'Leary"},{"quote":"The only thing I know is that no one ever sat in a therapist's or a psychiatrist's room saying, 'My parents just loved me too much.' The only thing you can do is love them and be around. Kids don't really care what your car is like or how big their house is. All they really care about is that you are around.","author":"James Corden"},{"quote":"Marriage has no guarantees. If that's what you're looking for, go live with a car battery.","author":"Erma Bombeck"},{"quote":"I play the harmonica. The only way I can play is if I get my car going really fast, and stick it out the window.","author":"Steven Wright"},{"quote":"Okay, let's talk about cartoon labels for half a second - some people think anything with a dog or a car or a colorful alien is garbage, which is not true. Look at Big Moose Red. It's, like, a $6 wine with a cheesy label, and it's actually a solid wine.","author":"Gary Vaynerchuk"},{"quote":"I have always had this mentality because I hated to break anything on the car.","author":"Alain Prost"},{"quote":"There is a limit to the application of democratic methods. You can inquire of all the passengers as to what type of car they like to ride in, but it is impossible to question them as to whether to apply the brakes when the train is at full speed and accident threatens.","author":"Leon Trotsky"},{"quote":"I've always liked speed. I own a car that I shouldn't be talking about because I'm an environmentalist, but the 1955 Porsche Spyder 550 RS is the finest sports car ever made.","author":"Robert Redford"},{"quote":"Racism has been for everyone like a horrible, tragic car crash, and we've all been heavily sedated from it. If we don't come into consciousness of this tragedy, there's going to be a violent awakening we don't want. The question is, can we wake up?","author":"Anna Deavere Smith"},{"quote":"The first thing I ever rode when I was a kid was a motorcycle, so I knew how to drive a motorcycle before a car.","author":"John Travolta"},{"quote":"Partnerships are increasingly seen through the prism of promises and expectations, and as a kind of product for consumers: satisfaction on the spot, and if not fully satisfied, return the product to the shop or replace it with a new and improved one! You don't, after all, stick to your car, or computer, or iPod, when better ones appear.","author":"Zygmunt Bauman"},{"quote":"We're in a giant car heading towards a brick wall and everyone's arguing over where they're going to sit.","author":"David Suzuki"},{"quote":"I am quite a relaxed person out of the car, but in the car I am aggressive, I never give up, I fight to the end and I try 100% all the time.","author":"Heikki Kovalainen"},{"quote":"Every summer my husband and I pack our suitcases, load our kids into the car, and drive from tense, crowded New York City to my family's cottage in Maine. It's on an island, with stretches of sea and sandy beaches, rocky coasts, and pine trees. We barbecue, swim, lie around, and try to do nothing.","author":"Hope Davis"},{"quote":"You can't stop everything from happening. But we've gotten to a point where we're certainly trying. If a car doesn't have four hundred air bags in it, then it's no good.","author":"Clint Eastwood"},{"quote":"My choices, including those related to the day-to-day aspects of life, like the use of a modest car, are related to a spiritual discernment that responds to a need that arises from looking at things, at people and from reading the signs of the times. Discernment in the Lord guides me in my way of governing.","author":"Pope Francis"},{"quote":"Many kids come out of college, they have a credit card and a diploma. They don't know how to buy a house or a car or health insurance or life insurance. They do not know basic microeconomics.","author":"Jesse Jackson"},{"quote":"A dream without ambition is like a car without gas... you're not going anywhere.","author":"Sean Hampton"},{"quote":"And that just shows you how important the car is in Formula One Racing.","author":"Murray Walker"},{"quote":"When a car's ahead of you, as long as you can see it, you get a tow, just like the draft in NASCAR. Even if it's a long ways down the track, it punches a hole in the air that has to help. When you're running alone, you can feel the difference, and it shows on the clock, too.","author":"Mario Andretti"},{"quote":"A bad sermon is like a car wreck - everyone slows down to see what happened.","author":"John Ortberg"},{"quote":"The thing about drugs and sex is that you lose all your inhibitions. I've had sex in trains, planes, wine bars... and quite a few car parks!","author":"Robbie Williams"},{"quote":"When I got the job on 'Lost,' I was a broke university student living in the crappiest part of town, with a duct-taped back window on a broken-down car. I existed on peanut butter and tea.","author":"Evangeline Lilly"},{"quote":"Nobody's ever asked me to pay for a meal before I've eaten it, I've never been pulled over just because I was driving the wrong kind of car in the wrong kind of area at the wrong time of night.","author":"Wentworth Miller"},{"quote":"Onion rings in the car cushions do not improve with time.","author":"Erma Bombeck"},{"quote":"Bad debt is debt that makes you poorer. I count the mortgage on my home as bad debt, because I'm the one paying on it. Other forms of bad debt are car payments, credit card balances, or other consumer loans.","author":"Robert Kiyosaki"},{"quote":"Selling an electric sports car creates an opportunity to fundamentally change the way America drives.","author":"Elon Musk"},{"quote":"The year most of my high school friends and I got our driver's permits, the coolest thing one could do was stand outside after school and twirl one's car keys like a lifeguard whistle. That jingling sound meant freedom and power.","author":"Sloane Crosley"},{"quote":"When kids run up to me and ask, 'What happened?' I just lean over and whisper, 'Cigarettes.' And once I was in a car and this girl at traffic lights was giving me the eye. She could only see my head, so I decided to do a 360 in the car seat to freak her out. Her face was like, 'Whoa, what is going on?' She sped off really quickly.","author":"Nick Vujicic"},{"quote":"My father's nephew was the blues musician, Lowell Fulson. Every time he came around, he had a pretty car, a beautiful woman and a slick sharkskin suit. Believe it or not, that's how I decided I wanted to get into music.","author":"Charlie Wilson"},{"quote":"Yes, my grandfather worked with Thomas Edison on the electric car, and he sold electric cars at the 1900 World's Fair in Paris.","author":"Al Jardine"},{"quote":"Never have more children than you have car windows.","author":"Erma Bombeck"},{"quote":"I like to put on hardcore when I have to clean my apartment, which I hate to do, but it's motivational. I like old heavy metal when I'm outside working on my car. Music has definite functions for me.","author":"Peter Steele"},{"quote":"I love race car drivers, I love gymnastics, I love UFC, I love police officers, I love firefighters. I just try to give them the same enjoyment they give me.","author":"Shaquille O'Neal"},{"quote":"In August of 2002, I survived a car accident. Although I can still see the van speeding toward us, I cannot bring to mind the crash itself - only its aftermath.","author":"Siri Hustvedt"},{"quote":"A car is like a mother-in-law - if you let it, it will rule your life.","author":"Jaime Lerner"},{"quote":"If a kid is old enough to drive a car or buy a gun, isn't he old enough to be held personally responsible for what he does with his car or gun? Or if he's a teenager, should someone else be blamed because he isn't as enlightened as an eighteen-year-old?","author":"Marilyn Manson"},{"quote":"I race to win. If I am on the bike or in a car it will always be the same.","author":"Valentino Rossi"},{"quote":"I remember being at Greenblatt's on Sunset, and some guy just walked straight up to me, and he had some bling on and whatever, and said something about a party down in Malibu and asked if I would jump in his car and go to the party. All I could think was, 'Who are you? I don't know you, and I don't care about how good your car is.'","author":"Yvonne Strahovski"},{"quote":"A racing car is an animal with a thousand adjustments.","author":"Mario Andretti"},{"quote":"Automobiles have always been part of my life, and I'm sure they always will be. What is it about them that moves me? The sound of a great engine, the unity and uniqueness of an automobile's engineering and coachwork, the history of the company and the car, and, of course, the sheer beauty of the thing.","author":"Edward Herrmann"},{"quote":"I rolled the second car that I ever owned, a Toyota 4 Runner. This was winter in Colorado, two weeks before the 2002 Olympic trials. I was driving in the outside lane, and my rear tire caught some black ice, and we totally turned sideways to the point where we were heading right toward the median.","author":"Apolo Ohno"},{"quote":"I don't want to be in my car all day. I love getting up in the morning in Venice and walking my dogs down to the cafe to get my tea, and then perhaps going to a bookstore and sitting and reading, then walking to the beach.","author":"Jessica Chastain"},{"quote":"I know people think we drive around in these nice cars and we do whatever we want and our parents will pay our credit cards, but that's not the case. Sure, my parents were generous; I got a nice car at 16, but at 18 I was cut off. I've worked really hard. I opened the store myself.","author":"Kim Kardashian"},{"quote":"Why do people talk of the horrors of old age? It's great. I feel like a fine old car with the parts gradually wearing out, but I'm not complaining,... Those who find growing old terrible are people who haven't done what they wanted with their lives.","author":"Martha Gellhorn"},{"quote":"Heartbreak was the impetus to me writing poems and music in the first place. Over the years, I had my heart broken so badly that if I didn't find a way to get all the pain out, I was going to lose my mind. I was crazy! Like, wanting to slash tires and smash car windows. Crazy! I was so hurt that I had to write.","author":"Jill Scott"},{"quote":"On a bike, being just slightly above pedestrian and car eye level, one gets a perfect view of the goings-on in one's own town.","author":"David Byrne"},{"quote":"I had a friend who was a clown. When he died, all his friends went to the funeral in one car.","author":"Steven Wright"},{"quote":"I admired the way McCain worked on campaign finance reform. I admired the way Nancy Pelosi stiffened the Democrats' spine during the health care debate. I admire the way Barack Obama has raised a dog in the White House without ever putting it on the roof of the car for a vacation drive.","author":"Gail Collins"},{"quote":"Had my own car at twelve years old. Left school in the tenth grade. Married when I was sixteen. Ain't hard to figure out; I was a man at a very young age.","author":"Joe Frazier"},{"quote":"In Japan, I live in a little neighborhood in the middle of nowhere. I don't have a bicycle or a car or anything, so my only movement is within the boundaries of my feet. I feel there's a need for that kind of conscientious objection to the momentum of the world.","author":"Pico Iyer"},{"quote":"Personally, I just think rap music is the best thing out there, period. If you look at my deck in my car radio, you're always going to find a hip-hop tape; that's all I buy, that's all I live, that's all I listen to, that's all I love.","author":"Eminem"},{"quote":"You can take lessons to become almost anything: flying lessons, piano lessons, skydiving lessons, acting lessons, race car driving lessons, singing lessons. But there's no class for comedy. You have to be born with it. God has to give you this gift.","author":"Steve Harvey"},{"quote":"Russia does not have a modern economy: it's a petro-power. The only thing it sells that the world wants to buy is oil and natural gas. When was the last time anyone bought a Russian computer? A Russian car? A Russian cell phone? Russia is so dependent on high energy prices that if oil falls below $100 a barrel, the Kremlin can't meet payroll.","author":"Kathleen Troia McFarland"},{"quote":"I thought boxes were the best toy. When my parents got a new car, I ran to my mother and said, 'Did it come in a box?'","author":"Colin Angle"},{"quote":"People say writing is really hard. That's very unfair to those who are doing real jobs. People who work in the fields or fix roofs, engineers, or car mechanics. I think lying on your back working under an oily car, that's a job.","author":"Paul Theroux"},{"quote":"Every little kid has always wanted to be a race car driver. This gets some of that out.","author":"David Alan Grier"},{"quote":"A lot of fun stuff happens when you go out on a bike compared to when you're in a car. You're more in the environment. It's enjoyable. Even when It's raining It's still fun.","author":"Stone Gossard"},{"quote":"People and squirrels are very different. Most people will not argue that. But I find that there is one situation in which they're very similar. And that is: when I am driving towards them in my car. Then they're kind of hard to tell apart - especially if the human is kind of hairy.","author":"Demetri Martin"},{"quote":"I am a spiritual person in an eastern religion kind of way. I learned that happiness for all of us is a switch that you flick in your brain. It doesn't have anything to do with getting a new house, a new car, a new girlfriend, or a new pair of shoes. Our culture is very much about that; we are never happy with what we have today.","author":"Tom Ford"},{"quote":"It was 100 feet of 16 mm black-and-white film of a car coming to a stop sign, and driving off. I had to decide how to frame and light it. It was magic. There was a sense of mystery.","author":"Conrad Hall"},{"quote":"I don't put myself on Jeff Beck's level, but I can relate to him when he says he'd rather be working on his car collection than playing the guitar.","author":"Ritchie Blackmore"},{"quote":"I love the practicality of a good car. You know what I mean? And when I say 'practicality,' I mean the complete practicality of a Ferrari 458, a wonderfully fantastic every day car.","author":"Hunter Hayes"},{"quote":"When I first moved to Los Angeles, I had a really bad run. I would sleep in my car during the day outside the Disney building in Burbank, and that's where I got my first job, which is really weird. I liked to stay around the studios and kind of get the good vibes going.","author":"Camille Guaty"},{"quote":"Some day you will be wheeled in for a heart bypass operation, and a surgeon will be the person who is now behind the counter when you renew your car registration at the department of motor vehicles.","author":"P. J. O'Rourke"},{"quote":"Building a house from scratch in the middle of a field is a bit like building a prototype car. As with all prototypes, if you're building a car you usually have the luxury of producing several prototypes before you arrive at the production line version - so the opportunity for changing things is quite rich.","author":"Kevin McCloud"},{"quote":"Marketers use big data profiling to predict who is about to get pregnant, who is likely to buy a new car, and who is about to change sexual orientations. That's how they know what ads to send to whom. The NSA, meanwhile, wants to know who is likely to commit an act of terrorism - and for this, they need us.","author":"Douglas Rushkoff"},{"quote":"I think women like Ferraris. A Ferrari is everybody's car.","author":"Tim Allen"},{"quote":"What Englishman will give his mind to politics as long as he can afford to keep a motor car?","author":"George Bernard Shaw"},{"quote":"One morning, about four o'clock, I was driving my car just about as fast as I could. I thought, Why am I out this time of night? I was miserable, and it came to me: I'm falling in love with somebody I have no right to fall in love with.","author":"June Carter Cash"},{"quote":"Years ago I met Richard Burton in Port Talbot, my home town, and afterwards he passed in his car with his wife, and I thought, 'I want to get out and become like him'. Not because of Wales, because I love Wales, but because I was so limited as a child at school and so bereft and lonely, and I thought becoming an actor would do that.","author":"Anthony Hopkins"},{"quote":"I do get scared of the dentist, so a drive-through dentist might make me feel more at home. If I got to stay in my car.","author":"Jessica Pare"},{"quote":"The energy of the crowd is insane. Twenty thousand people. It's the biggest jolt of adrenaline. It's very hard to explain. You know the old story about the woman lifting the car off her kid? It's in that realm. You can actually hurt yourself and not know it.","author":"Tom Petty"},{"quote":"My hair is way, way long. I've hitchhiked across the country a zillion times. I've ridden in every car. I was never a hippie. It takes more than long hair.","author":"Penn Jillette"},{"quote":"I drive a car, like an adult. Not brilliantly. I'm not great.","author":"Karl Pilkington"},{"quote":"I do sing in the car. I actually sing Britney Spears songs in the car - me and a close friend of mine. She lives in West Palm and I live in Miami, and when we're going back and forth to see each other, we sing: 'Oh, Baby Baby.' We sing all these 1990s songs. We're like two 14-year-old kids just having a good time.","author":"Kelly Rowland"},{"quote":"When you are fitted in a racing car and you race to win, second or third place is not enough.","author":"Ayrton Senna"},{"quote":"If you own a home with wheels on it and several cars without, you just might be a redneck.","author":"Jeff Foxworthy"},{"quote":"To attract men, I wear a perfume called 'New Car Interior.'","author":"Rita Rudner"},{"quote":"There's three things men always talk about - women, sports, and cars.","author":"Mario Lopez"},{"quote":"I just feel rejuvenated in such a big way because of these race cars I get to drive.","author":"Jeff Gordon"},{"quote":"People spend so much time in their cars, and it's a legal way to have fun by speeding a little bit or testing yourself a little bit, and you get to invest in your car. For some people, it becomes their baby.","author":"Jordana Brewster"},{"quote":"I was quiet, a loner. I was one of those children where, if you put me in a room and gave me some crayons and a pencils, you wouldn't hear from me for nine straight hours. And I was always drawing racing cars and rockets and spaceships and planes, things that were very fast that would take me away.","author":"Gary Oldman"},{"quote":"I'm starting to think about things that I want to do, things that are fun. One of them is driving a car like a Porsche. I've driven a lot of cars - sedans, trucks and big family vehicles all year long. But there's nothing like a four-wheel-drive Porsche.","author":"Kevin O'Leary"},{"quote":"It's not just the kid who's spent every penny from his job to upgrade his car to tell the world he cares about sports cars, it's also the person driving around in a fuel-conscious hybrid electric car, because it's more a message to the world than an effective means of saving fuel, to be quite honest.","author":"Richard Hammond"},{"quote":"You have to wait six months to purchase a fuel efficient automobile made from overseas.","author":"Ed Markey"},{"quote":"I don't like new cars; I'm into vintage cars - there's a Jaguar E-Type in the 'Goldie' video.","author":"ASAP Rocky"},{"quote":"We aren't addicted to oil, but our cars are.","author":"James Woolsey"},{"quote":"I admit to wasting my life messing around with fast cars and motorcycles.","author":"Brock Yates"},{"quote":"Here comes 40. I'm feeling my age and I've ordered the Ferrari. I'm going to get the whole mid-life crisis package.","author":"Keanu Reeves"},{"quote":"I love vintage cars because you can do so much more to them.","author":"T-Pain"},{"quote":"When it comes to cars, only two varieties of people are possible - cowards and fools.","author":"Russell Baker"},{"quote":"See, what you're meant to do when you have a mid-life crisis is buy a fast car, aren't you? Well, I've always had fast cars. It's not that. It's the fear that you're past your best. It's the fear that the stuff you've done in the past is your best work.","author":"Robbie Coltraine"},{"quote":"In the last three years of racing I've met as many women fans as men fans, and in NASCAR it's the same thing. My wife loves cars, but the difference is she doesn't have 20 years of understanding the background of them. She basically drives them and uses her gut feelings as to which is best.","author":"Tim Allen"},{"quote":"The only big things I've purchased are my dad's heart valve and a Rolls-Royce for my parents, for their anniversary. And that was only because my dad had a Lady Gaga license plate on our old car and it was making me crazy because he was getting followed everywhere, so I bought him a new car.","author":"Lady Gaga"},{"quote":"I don't run a car, have never run a car. I could say that this is because I have this extremely tender environmentalist conscience, but the fact is I hate driving.","author":"David Attenborough"},{"quote":"But my passion is racing cars. It's what I like to do in my off time.","author":"Mark-Paul Gosselaar"},{"quote":"I had more clothes than I had closets, more cars than garage space, but no money.","author":"Sammy Davis, Jr."},{"quote":"I would have probably stolen cars - it would have given me the same adrenaline rush as racing.","author":"Valentino Rossi"},{"quote":"Tesla is here to stay and keep fighting for the electric car revolution.","author":"Elon Musk"},{"quote":"I liken myself to Henry Ford and the auto industry, I give you 90 percent of what most people need.","author":"Adam Osborne"},{"quote":"You're safer in the race car than you are in cars going to and from the track.","author":"Mario Andretti"},{"quote":"Every day I'd come home after school, pop the hood of my mom's car, put alligator clips on the battery, and wire into the house and go play on my computer. If I used it for too long, I'd wear down the car battery, and my mom would be all mad at me the next day.","author":"Ryan Holmes"},{"quote":"We should tell our kids to just have fun, participate and not get bent on winning or losing. But every coach, when they say that, they say it tongue in cheek, 'Don't worry about winning': If you win I'll get you ice cream, but if you lose I'm going to pout in the car.","author":"Bode Miller"},{"quote":"The Cobra is my personal favorite car. The original 289 Cobra is the car I respect the most. I like to drive the 289 better than the 427.","author":"Carroll Shelby"},{"quote":"I was 16 years old, driving to LA, and sleeping in my car, just trying to make it happen.","author":"Nick Cannon"},{"quote":"People's jobs are the biggest asset that they have. The net present value of your job is worth more than your house or your stock portfolio. As people decide whether they're going to buy a car, they're more concerned about whether they have a job and are likely to have a job next year.","author":"David Malpass"},{"quote":"I was already on pole, then by half a second and then one second and I just kept going. Suddenly I was nearly two seconds faster than anybody else, including my team mate with the same car.","author":"Ayrton Senna"},{"quote":"They think they can make fuel from horse manure - now, I don't know if your car will be able to get 30 miles to the gallon, but it's sure gonna put a stop to siphoning.","author":"Billie Holiday"},{"quote":"Dogs feel very strongly that they should always go with you in the car, in case the need should arise for them to bark violently at nothing right in your ear.","author":"Dave Barry"},{"quote":"Having played many roles of scientific intellect I do have an empathy for that world. It's been hard on me because flying the Enterprise for seven years in Star Trek and sitting in Cerebro in X-men has led people to believe that I know what I'm talking about. But I'm still trying to work out how to operate the air conditioning unit on my car.","author":"Patrick Stewart"},{"quote":"I'm a big potato chip girl. I don't like chocolate and cakes and all that, but I have to have my potato chips. I've got bags in the back of my car right now! But I never beat myself up about it, because, look: You can't give up every damn thing. You need something in your life that you like just because you like it!","author":"NeNe Leakes"},{"quote":"To have some idea what it's like, stand in the outside lane of a motorway, get your mate to drive his car at you at 95 mph and wait until he's 12 yards away, before you decide which way to jump.","author":"Geoffrey Boycott"},{"quote":"I could never drive in a great big car; people like me because I'm a man of the people, a hustler.","author":"Terry McAuliffe"},{"quote":"Home, nowadays, is a place where part of the family waits till the rest of the family brings the car back.","author":"Earl Wilson"},{"quote":"I wanted to be a mechanic. When I was 14 I wanted to quit school and go work on my car. But my dad said Son, you shouldn't do that. You should stay in school until your education is finished, and when you're done, don't make your hobby your job.","author":"Eric Bana"},{"quote":"I have bad reflexes. I was once run over by a car being pushed by two guys.","author":"Woody Allen"},{"quote":"I recorded a song called, I Fall to Pieces, and I was in a car wreck. Now I'm worried because I have a brand-new record, and it's called Crazy!","author":"Patsy Cline"},{"quote":"When you first get money, you buy all these things so no one thinks you're mean, and you spread it around. You get a chauffeur and you find yourself thrown around the back of this car and you think, I was happier when I had my own little car! I could drive myself!","author":"Paul McCartney"},{"quote":"The most important loan to pay is your student loan. It's more important than your mortgage, car and credit card payments. You cannot discharge student loan debt in the majority of cases.","author":"Suze Orman"},{"quote":"The bass player's function, along with the drums, is to be the engine that drives the car... everything else is merely colours.","author":"Suzi Quatro"},{"quote":"The word 'geek' today does not mean what it used to mean. A geek isn't the skinny kid with a pocket protector and acne. There can be computer geeks, video game geeks, car geeks, military geeks, and sports geeks. Being a geek just means that you're passionate about something.","author":"Olivia Munn"},{"quote":"On Memorial Day, I was out floating on Lake Norman and came across Denny Hamlin. We struck up a conversation, and one of the first things we were talking about was how much it helped him when he started racing the Cup car and how much it helped his Nationwide program.","author":"Danica Patrick"},{"quote":"You must do as your people do. If my people are poor, I must be poor. People ask me, 'Why don't you find a personal coach or a private car?' I can't. Then I won't be part of my people.","author":"Haile Gebrselassie"},{"quote":"At a car dealership, the person who sells the car is the hero, and also gets the commission. But if the mechanics don't service that car well, the customer won't return.","author":"Roger Staubach"},{"quote":"I have mentally overcome situations most of you would be terrified to ever attempt: heights, fire, needles, spiders, snakes, angry monkeys, being shot, being hit by a car, going blind - you name it, I have been in a situation where I have had to mentally overcome my inherent fears to do my job.","author":"Criss Angel"},{"quote":"A life can get knocked into a new orbit by a car crash, a lottery win or just a bleary-eyed consultant giving bad news in a calm voice.","author":"David Mitchell"},{"quote":"My mother's sister was killed in a trolley car accident, so I was raised as one of eight with my sister and six male cousins.","author":"Alan King"},{"quote":"I drive a hybrid, moving into an electric car. I only drink tap water, never consume food that's travelled.","author":"Nassim Nicholas Taleb"},{"quote":"I was a little different. I still say I'm a little different, because success to me is not having the most money, or having the biggest car or the biggest house.","author":"Herschel Walker"},{"quote":"I bought a 1964 Bentley for $1,600 and re-built it over five years. When I drove it in Tokyo after that, it was the pride of the road. That car would command at least $150,000 today because 'Bikram' has restored it.","author":"Bikram Choudhury"},{"quote":"To say that I am organized is an understatement, but my car tells a different story.","author":"Emily Procter"},{"quote":"There are going to be little victories that we claim, even if it's finishing 15th and putting the car back in hauler without a scratch on it.","author":"Kurt Busch"},{"quote":"The will is never free - it is always attached to an object, a purpose. It is simply the engine in the car - it can't steer.","author":"Joyce Cary"},{"quote":"My parents always taught me never to take anything for granted because it can be taken away from you like that, especially when it comes to looks. I could get into a car crash tomorrow and disfigure my face. So I have to stay grounded.","author":"Lance Gross"},{"quote":"'LaFerrari' means 'the Ferrari.' The excellence. In this car, we put everything we are able to do. Our extreme technology, extreme experience, extreme capability. And this has been the first Ferrari totally designed in our design center.","author":"Luca Cordero di Montezemolo"},{"quote":"I just want to do my best, to be as close to the top as I can, and to get the maximum out of the car.","author":"Pastor Maldonado"},{"quote":"I don't think Mercedes-Benz says anything about me, really. I was in a situation where I was able to get a really nice car, and I'm proud to have it.","author":"Lauren Lee Smith"},{"quote":"When your dad is a country music fan and you take long car trips, you become one too.","author":"Chip Esten"},{"quote":"Shutting off the thought process is not rejuvenating; the mind is like a car battery - it recharges by running.","author":"Bill Watterson"},{"quote":"When my car runs out of gas, I buy a new one. I don't want to ride around in a quitter.","author":"Stephen Colbert"},{"quote":"I quickly realized that shopping on Amazon had made the idea of parking my car and going into a store feel like an outrageous imposition on my time and good nature.","author":"Maria Semple"},{"quote":"So much of life is luck. One day you make a right turn and get hit by a car. Turn left and you meet the love of your life. I think I made the correct turn.","author":"Loretta Swit"},{"quote":"If you build a car, you can only sell it once. If you paint a fence, you only get paid for it once. If you create a piece of software that's essentially free to reproduce, you can keep getting paid over and over perpetually.","author":"Markus Persson"},{"quote":"Dad always explained the car engine when he repaired it, and he had many technical books, so I was making electromagnets by age eight as well as reading my mother's medical and nursing books. I suspect I was born with a boundless curiosity, and this was encouraged through my childhood.","author":"Barry Marshall"},{"quote":"When women break that taboo and they're not afraid to drive that car by herself - that's it. Now she has the guts to speak up for herself and take action.","author":"Manal al-Sharif"},{"quote":"When people switch to car-sharing from car ownership, they reduce their vehicle miles traveled by 44 percent, and thus their greenhouse gas emissions go down by, like, 40 percent.","author":"Jessica Scorpio"},{"quote":"It's not that I don't want a fast car. I like the speed. I'm just not the type of person who finds a sports car a sexy car.","author":"Inga Cadranel"},{"quote":"I like the guitar better these days. I like the bass, too, but it's hard to fit a bass amp in a small car.","author":"Dee Dee Ramone"},{"quote":"What Paris has done right is to make it awful to get around by car and awfully easy to get around by public transportation or by bike.","author":"Serge Schmemann"},{"quote":"Going to car racing school was phenomenal.","author":"Michelle Rodriguez"},{"quote":"I definitely I prefer to sing in the car. I don't sing in the shower, maybe its because that's the one time I don't need to talk to anyone so I should just shut up, otherwise I'm just, you know, jibber jabber.","author":"Haley Reinhart"},{"quote":"A man sits in his car at the traffic lights, waiting for them to go green.","author":"Michael Frayn"},{"quote":"We talked about many issues, like welfare, is it the way of life or hand up? Talked about size of government, how much should it tax families and small businesses? And when we left that lunch, we got in the car and I looked over at Chuck and said, 'I'll be damned. we're Republicans.'","author":"Susana Martinez"},{"quote":"To drive an F1 car you have to be a little mad. On the morning of a race there's a mix of excitement and fear. If it's a wet track, then it's worse as you're not in control most of the time, which is the thing all drivers fear the most.","author":"Jenson Button"},{"quote":"I know that BMW is now a sponsor of the USOC - of the United States Olympic Committee - so they offer the use of their aerodynamic speed-tunnel for testing and such for the athletes, which is a great advantage. But to be honest with you, I'd rather have a free car!","author":"Apolo Ohno"},{"quote":"In sport there is never any moment that is the same as the other. I have been in Formula One for 12 years, and out of that I had one year with the perfect car.","author":"Michael Schumacher"},{"quote":"Sometimes movie-making happens like clockwork; other times, like a car accident.","author":"Eric Roberts"},{"quote":"I never bothered with cars. I was probably one of the few kids in school who didn't run around with hot-rod magazines. As I would be at home fiddling with my guitar, they would be fiddling with a car engine.","author":"Angus Young"},{"quote":"People get excited around me and behave differently than they would normally. I don't feel different from anyone else, except that I drive a racing car round in circles faster than somebody else.","author":"Michael Schumacher"},{"quote":"Porsche is a driver's car - a performance car. That was funny - here's this awesome car, but it's got no cup holders.","author":"Jason McCoy"},{"quote":"It's a tricky place, especially the last sector. I wasn't happy in practice. I wasn't happy with the car and I wasn't happy with myself. But I always thought there was more in the car.","author":"Sebastian Vettel"},{"quote":"When I was 7, an old lady was driving too fast in my neighborhood and hit me with her car. I was running out of the house, and when I got halfway into the street, my mom saw the car and yelled for me to run back. As I turned around the car hit me, dragged me five houses down the road, and I fractured my collarbone.","author":"Rutina Wesley"},{"quote":"I have a real passion for driving. Earlier on in my life I wanted to be a race car driver. But I don't pay an extortionate amount of money for cars. I'm pretty frugal.","author":"John Barrowman"},{"quote":"I was really sad after 'The Avengers' when I realized I was not going to have a part in 'Thor 2' or 'Captain America: The Winter Soldier.' But I'm not arguing with my fantastic plane and my really cool car.","author":"Clark Gregg"},{"quote":"When it comes to romance, I believe in keeping it simple. With my last girlfriend, we were on our way to our favorite restaurant when I pretended that the car was crappin' out. I asked her to get out and check if smoke was coming from the exhaust. When she did, I popped the trunk and inside were six dozen roses and a stuffed bear.","author":"Justin Chon"},{"quote":"I had some vague memory of visiting Canberra as a lad, when we came up with my father by car. But when I made the long train journey from Sydney to Canberra and arrived at the little stop, I did wonder slightly whether this really was the national capital.","author":"John Henry Carver"},{"quote":"I enjoy trying to develop a car and Mercedes are one of the biggest car manufacturers in the world.","author":"Lewis Hamilton"},{"quote":"We invented the car, and it made it easier for us to crash and die. If I gave a car to my grandfather, he would die in five minutes, while I have grown up slowly to accept speed.","author":"Umberto Eco"},{"quote":"It's like watching a car accident, that reality TV.","author":"Enrico Colantoni"},{"quote":"I listened to it last night for the first time since we started this project. I went out to my car and put it in and went to an empty parking lot and just listened and read the little pamphlet that came with it. After two or three songs I burst into tears.","author":"Randy Bachman"},{"quote":"My worst habit is probably that I'm extremely messy. I'm a big scatter-brain - I'm always losing my car keys, or worse, forgetting where I parked my car in the car park.","author":"Georgia Salpa"},{"quote":"I have a lot of great racing memories growing up in Europe as a young boy - playing with car parts on my dad's desk, watching the races on Sunday afternoons to try and spot him on TV, even having the chance to go to Formula 1 races where he was working.","author":"Charlie Kimball"},{"quote":"I borrowed my friend's car the other day in an attempt to persuade my husband that we needed a car and literally this is true, in the first day of borrowing the car, I got three tickets and I rear-ended it.","author":"Emily Mortimer"},{"quote":"We were racing at circuits where there were no crash barriers in front of the pits, and fuel was lying about in churns in the pit lane. A car could easily crash into the pits at any time. It was ridiculous.","author":"Jackie Stewart"},{"quote":"I remember one day, when things were going frightfully well, I went to buy myself a really smashing car. I asked them to show me a Porsche with an automatic gearbox, and the salesman called over all the other salesmen, and they stood around absolutely roaring with laughter.","author":"Mary Quant"},{"quote":"I think everyone is forgetting what plastic surgery is for - if you have a face-eating tumour, lose a breast or are involved in a car accident, then it's a good idea.","author":"Sally Phillips"},{"quote":"With tennis, you can go pick up a racket, take a lesson, and understand how much talent and skill it takes to be as good as the top pros. Same with golf: pick up a club. But not many can go out and get in a race car and experience a drive at over 200 miles an hour.","author":"Mario Andretti"},{"quote":"My very first car was a grey Alfa Romeo Alfasud, which I got in 1987. But, in our family, all cars were for sale - so they might be there in the morning and were gone at night. In the mid-90s, I joined Porsche and the Carrera was the car, and the Carrera 4S was the one they gave me. As a wee boy from Dumfries, I couldn't believe it.","author":"Allan McNish"},{"quote":"If you think about jeans or phones or television, we are used to new brands popping up right and left. But in the car industry, we grew up with Mercedes, BMW, General Motors, and Ford, and nobody can remember during his or her upbringing a new car brand coming to life.","author":"Henrik Fisker"},{"quote":"I was a pizza delivery boy at the Pizza Oven in Canton. I wanted to get fired so bad, I actually wrecked the delivery car, but they wouldn't fire me because I was the only person they had working there.","author":"Marilyn Manson"},{"quote":"Rebellion is what you make of it. When you've been on a tour bus for two months straight, and then you get in your car and drive wherever you want, that can feel rebellious.","author":"Taylor Swift"},{"quote":"I bought a car, but not just any car; I bought a Volvo, which was the safest on the road at the time. It's not any more, so I upgraded to the Mercedes.","author":"Holland Roden"},{"quote":"Sometimes I wish I could drive a car, but I'm gonna drive a car one day, so I don't worry about that.","author":"Stevie Wonder"},{"quote":"If God drives a car, He'd drive a 1973 Ford LTD Brougham sedan with a claret-colored vinyl roof, with oxblood leather upholstery and an opera window.","author":"Douglas Coupland"},{"quote":"I think a lot of writers, male and female, write as if their parents were killed in a car accident when they were 2, and they have no one to hold accountable. And unfortunately, I don't have that. I have parents who I care about what they think.","author":"Mindy Kaling"},{"quote":"I had a fairly enlightened dad, though if you looked at his resume, it might not seem that way. He was a chartered accountant for Price Waterhouse. He was strict, and we had a very ordered life. To this day, I am the least materialistic person I know, because my father didn't raise me to just go out and buy this or that car.","author":"Hugh Jackman"},{"quote":"I don't have any expensive habits. I'm not a car collector or any of that nonsense. But I'd love to be incredibly wealthy for no reason at all.","author":"John Lydon"},{"quote":"I drive an American car. It's a Chrysler. That's not an endorsement. It's more like a cry for pity.","author":"Michael Moore"},{"quote":"White is actually one of my favorite colors. I have a white car. I love white.","author":"Kim Kardashian"},{"quote":"I like the desert for short periods of time, from inside a car, with the windows rolled up, and the doors locked. I prefer beach resorts with room service.","author":"Anne Lamott"},{"quote":"My mother was determined to make us independent. When I was four years old, she stopped the car a few miles from our house and made me find my own way home across the fields. I got hopelessly lost.","author":"Richard Branson"},{"quote":"If a movie is really working, you forget for two hours your Social Security number and where your car is parked. You are having a vicarious experience. You are identifying, in one way or another, with the people on the screen.","author":"Roger Ebert"},{"quote":"I want to be remembered for the work that I've done, rather than the car accidents that I've gotten into, the men that I've not dated - or the man that I have.","author":"Lindsay Lohan"},{"quote":"Drug misuse is not a disease, it is a decision, like the decision to step out in front of a moving car. You would call that not a disease but an error of judgment.","author":"Philip K. Dick"},{"quote":"My grandma's the most careful, safe driver in the world. You put her in a rental car, and she's doing doughnuts in the K-Mart parking lot!","author":"Jeff Foxworthy"},{"quote":"Nobody wants to buy a $60,000 electric Civic. But people will pay $90,000 for an electric sports car.","author":"Elon Musk"},{"quote":"To drive a car in rural America is freedom. Before I had a car, I'd never seen a rock and roll show, I'd never seen a comic or a show.","author":"Penn Jillette"},{"quote":"You know what I really love? The CD players in a car. How when you put the CD right up by the slot, it actually takes it out of your hand, like it's hungry. It pulls it in, and you feel like it wants more silver discs.","author":"Tom Waits"},{"quote":"Transcendental meditation is like a car, a vehicle that allows you to go within. It's a mental technique.","author":"David Lynch"},{"quote":"Wherever I am in the world, if I get free time when I'm filming I always hire a car, take to the road, drive for miles and explore.","author":"Helen Mirren"},{"quote":"The body is like a car: the older you become the more care you have to take care of it - and you don't leave a Ferrari out in the sun.","author":"Joan Collins"},{"quote":"I remember driving to North Carolina when I was a little girl in a snowstorm to get down to my mom's family in the Carolinas. There were chains on the car - it was the late sixties - and we were just singing in the car. Christmas carols.","author":"Tori Amos"},{"quote":"Part of us believes the new car is better because it lasts longer. But, in fact, that's the worst thing about the new car. It will stay around to disappoint you, whereas a trip to Europe is over. It evaporates. It has the good sense to go away, and you are left with nothing but a wonderful memory.","author":"Daniel Gilbert"},{"quote":"I read on my iPad when I travel. I listen to audiobooks in the car. I read books in my bedroom, where I have a comfortable couch, a lamp and two dogs to keep me warm.","author":"Isabel Allende"},{"quote":"When a police officer tells you to stay in the car, you stay in the car.","author":"Reese Witherspoon"},{"quote":"The thing people don't understand is that touring or travelling or whatever you do in my position means you go to all these cool places all over the world, but you see everything from a car window. You don't get to see much of the city or meet people at all.","author":"Taylor Momsen"},{"quote":"When I climb into my car, I enter my destination into a GPS device, whose spatial memory supplants my own. I have photographs to store the images I want to remember, books to store knowledge and now, thanks to Google, I rarely have to remember anything more than the right set of search terms to access humankind's collective memory.","author":"Joshua Foer"},{"quote":"I'm one of those people, in any country I'm in, if somebody could just put me in a car or a bus, I'll look out the window and say, 'OK, there's the Tower of London, there's Buckingham Palace, there's Big Ben,' and if it all takes about five minutes, perfect. I've seen all of it and I can go home.","author":"Gilbert Gottfried"},{"quote":"Trying to run Congress without human relationships is like trying to run a car without motor oil. Should we be surprised when the whole thing freezes up?","author":"Jonathan Haidt"},{"quote":"You know, in Los Angeles, you're constantly in your car, you're sealed up, you're not walking around. Whereas in New York, after a while, all your stuff is kind of public, in one way or the other. I'm not saying either one of those is bad; they're both great for a very specific kind of comedian. And I'm glad that they both exist.","author":"Patton Oswalt"},{"quote":"I started rapping before anybody had ever bought a car from it. It was truly about the art form and the culture, more so than now, where it's a successful way to make money. Back then you had to be doing it because you liked it.","author":"Ice T"},{"quote":"My first-ever car, my parents bought me a red Fiat Uno. I was 17 and just so happy to have a car, so I was very fortunate that my parents were in a position to get me one - it was a secondhand car, but I was just so happy to have it.","author":"Victoria Beckham"},{"quote":"There's a lot of stress... but once you get in the car, all that goes out the window.","author":"Dan Brown"},{"quote":"First, I thought Twitter was some kind of hybrid car being developed by Government Motors. Then I thought it was a new bite-size snack combining what's best of the Frito and the Cheeto. Then I found out it was me. On a laptop. At the U.S. Open. Having fun.","author":"Dan Jenkins"},{"quote":"I was always an observer, even as a child. I could be satisfied to sit in a car for 3 hours and just look at the street go by while my mother went shopping.","author":"Jonathan Winters"},{"quote":"People get really nuts around cars. They get angry at cars, they get angry at their car, they get angry at people driving in cars; there's something really comical about that, about automobiles.","author":"Matt Dillon"},{"quote":"I have a car that I like - an Aston Martin - for Sunday drives in the country.","author":"Seth MacFarlane"},{"quote":"I've worked as a labourer, driven taxis and school buses, and been a car mechanic - whatever I could do just to get by. But it does mean that I know a little bit about a lot of things.","author":"Cory Monteith"},{"quote":"I've always listened to a lot of rap. It's all, 'Look at this car that cost me so much money, look at this Champagne.' It's super fun.","author":"Lorde"},{"quote":"If you don't have the story and the unfolding of the trajectory of the saga, it's like getting in a car and not having any gas.","author":"Gus Van Sant"},{"quote":"A geek isn't the skinny kid with a pocket protector and acne. There can be computer geeks, video game geeks, car geeks, military geeks, and sports geeks. Being a geek just means that you're passionate about something.","author":"Olivia Munn"},{"quote":"Like all soul singers, I grew up singing in church but sometimes I would leave early and sit in the car listening to gospel band, The Blind Boys of Alabama. Hearing their lead singer Clarence made me connect the idea of church and show business and see how I could make a career singing music that stirred the soul.","author":"Daryl Hall"},{"quote":"When I saw all those other drivers, I realized that they wanted to win that money just as much as I did. But I didn't have to worry. A tire came off my car and I was lucky I got it off the track.","author":"Buck Baker"},{"quote":"My health is wonderful. I work out. I'm working. Playing music. I have a beautiful wife, a nice home, a nice car, I got money in the bank. I got three beautiful dogs that love me. Like I said, I'm blessed. I survived.","author":"Steven Adler"},{"quote":"Have you ever noticed how nice people are at the car wash?! Maybe it's just me, but it makes me happy. Weird, I know!","author":"Brittany Snow"},{"quote":"These songs are old friends I have entertained myself with when I'm washing the dishes, driving to the store and walking down the aisles. The ones that you sing when you're driving in the car and as a singer you always go back to them.","author":"Al Jarreau"},{"quote":"I always keep a ball in the car. You never know.","author":"Hakeem Olajuwon"},{"quote":"The hardest part was when I was in high school not having a job and always being broke. I had to get to auditions without a car. I either took the bus or walked.","author":"Cuba Gooding, Jr."},{"quote":"It's like, it's kind of like if you ever had a car and it was a bit of a clunker but you love it, that's my show. It's a bit of a clunker but I know where everything is and I like it.","author":"Craig Ferguson"},{"quote":"We all drive differently and have different styles. For me I need a car I can develop beneath me and feel comfortable in. If the car feels neutral and unbalanced it doesn't work for me.","author":"Jenson Button"},{"quote":"I am so sick of reading about another car bomb, another suicide bomber, another 10, 20, 30, 70, 100 people dead in a day, both Americans and Iraqis.","author":"Rosanne Cash"},{"quote":"The hydrogen powered car, with its high fuel mileage and zero emission rate, is just one example of the products under development that will help increase our energy independence.","author":"Dan Lipinski"},{"quote":"Whenever I have bid a hasty goodbye to a loved one, I've always made sure that my record collection was safely stored away in the boot of the car.","author":"Robert Plant"},{"quote":"The mechanic could lift up the bonnet of the car and show me four dwarves strapped to a pair of tandems and tell me that the motor was actually dwarf-powered and that one of the little fellows had to be replaced, and I'd just be numbly writing out a cheque and scribbling 'new dwarf - car' on the stub.","author":"John Niven"},{"quote":"A captivating moment was when I realized that people, including myself, were not saying, 'I just bought an item on eBay.' They were saying, 'I just won an item on eBay.' It was the thrill of the hunt. I bought a car on eBay.","author":"Mary Meeker"},{"quote":"My brother was a lifeguard in a car wash.","author":"Henny Youngman"},{"quote":"The Italians and Spanish, the Chinese and Vietnamese see food as part of a larger, more essential and pleasurable part of daily life. Not as an experience to be collected or bragged about - or as a ritual like filling up a car - but as something else that gives pleasure, like sex or music, or a good nap in the afternoon.","author":"Anthony Bourdain"},{"quote":"If you are a writer you locate yourself behind a wall of silence and no matter what you are doing, driving a car or walking or doing housework you can still be writing, because you have that space.","author":"Joyce Carol Oates"},{"quote":"Being poor with three small children is terrifying. You can't make any plans. You know you're not going on holiday, ever. There's no way you could ever afford driving lessons or a car. And the guilt I used to feel: they had holes in their shoes, and at one point, I had to send them to school wearing Wellingtons when the sun was shining.","author":"Sue Townsend"},{"quote":"Here's a trick to giving the birds-and-bees talk: You gotta do it in a car, so they can't escape. That's what all my girlfriends' parents did.","author":"Martha MacIsaac"},{"quote":"Forget the damned motor car and build the cities for lovers and friends.","author":"Lewis Mumford"},{"quote":"Honestly, the average American spends about 52 minutes a day in commute traffic. And as much as I love driving my car and many people like driving their car, commuting has never been fun for me.","author":"Sebastian Thrun"},{"quote":"The reason we have cancer and heart disease is the same reason you can't get rid of the wear and tear on your tires on your car: as soon as you use them, you are wearing them away. You can't make eternal tires, and it's the same with the human body.","author":"S. Jay Olshansky"},{"quote":"I've got a great team of engineers behind this race car. I've got a great bunch of mechanics that make it reliable. This car is developed to go out there and be better than the Reynard, and I feel that it is.","author":"Al Unser"},{"quote":"I have an answering machine in my car. It says, I'm home now. But leave a message and I'll call when I'm out.","author":"Steven Wright"},{"quote":"My wife wants sex in the back of the car and she wants me to drive.","author":"Rodney Dangerfield"},{"quote":"Mass transportation is doomed to failure in North America because a person's car is the only place where he can be alone and think.","author":"Marshall McLuhan"},{"quote":"Driving a stock car does not require much handling ability, at least not as compared to Grand Prix racing, because the tracks are simple banked ovals and there is almost no shifting of gears. So, qualifying becomes a test of raw nerve - of how fast a man is willing to take a curve.","author":"Tom Wolfe"},{"quote":"So I was getting into my car, and this bloke says to me 'Can you give me a lift?' I said 'Sure, you look great, the world's your oyster, go for it.'","author":"Tim Vine"},{"quote":"When you put gas in your car you are making a political statement, because you are supporting the empires that control and continue the destruction of some countries.","author":"Javier Bardem"},{"quote":"I live a good life but a pretty simply life. I just store all my money under my mattress. My wife and I travel, and I bought my dream car, the Cobra.","author":"Aaron Paul"},{"quote":"The way you continue to be a successful business is you don't wait for the car to go off the cliff. You have to manage yourself. And make sure you do it in the right way so you are not making decisions in crisis.","author":"Roger Goodell"},{"quote":"One of my favorites is one called 'Rory's Radio' that I wrote about my brother Jeff's best friend growing up - his name was Rory Dunigan. I dedicated my first record to my brother, who got killed in a car accident in 1999, and I really didn't have any songs on the first album about him, nothing on a personal note.","author":"Ashton Shepherd"},{"quote":"Whenever I drive under a yellow light, I always kiss my finger and tap it on the roof of the car.","author":"Jared Padalecki"},{"quote":"Adults are locked into car payments and divorces and work. They haven't got time to think fresh.","author":"Gary Paulsen"},{"quote":"I accept the Old Testament as more of an action movie: blood, car chases, evacuations, a lot of special effects, seas dividing, mass murder, adultery. The children of God are running amok, wayward. Maybe that's why they're so relatable.","author":"Bono"},{"quote":"I'm not curing cancer or running a small county. I haven't developed a greener car. I just play act. And if I can bring people a moment of fun and relief in their lives, well, that's the win.","author":"Jane Elliot"},{"quote":"A critic is a man who knows the way but can't drive the car.","author":"Kenneth Tynan"},{"quote":"Freedom is not an ideal, it is not even a protection, if it means nothing more than freedom to stagnate, to live without dreams, to have no greater aim than a second car and another television set.","author":"Adlai Stevenson"},{"quote":"A woman is gentle, soft, delicate, and a man's position is to protect her, help her up stairs, make sure she's in the car safely first. Take good care of your woman, and the sky's the limit!","author":"Taraji P. Henson"},{"quote":"I think I hid my singing talent from a lot of my friends at school because I didn't want to alienate anyone. If everyone was singing along in the car to a Madonna song, I didn't join in because when we're younger we're afraid of sticking out or showing off, when in fact we should own those things that make us really unique.","author":"Idina Menzel"},{"quote":"In my iPod, there are many operas, from A to Z. I have 'Aida' and 'Boheme' and 'Butterfly' and 'Cavalleria'. My passion is for opera, but when I'm in the car, I listen to everything.","author":"Andrea Bocelli"},{"quote":"When life was worrying about a car payment or a rent payment and a bill, you're so consumed with that, you really don't have time to know yourself. That's surviving and getting by.","author":"Fred Durst"},{"quote":"I've never been to a race car race before.","author":"Christina Ricci"},{"quote":"Come rain or shine I walk short distances rather than taking my car.","author":"Sophie Ellis-Bextor"},{"quote":"The media is convincing people that if you have that 'next thing,' that diamond, the right car, then you'd be happier.","author":"Hill Harper"},{"quote":"Toyota was the first to put a commercial fuel cell powered car on the road, and I have no doubt that Toyota will continue to be in the front lines in the development of competitive fuel cell vehicles.","author":"Maurice Strong"},{"quote":"I've tried everything other than jumping out of a plane, but nothing gives you an adrenaline rush like racing a car.","author":"Nigel Mansell"},{"quote":"I love driving my car on any highway.","author":"Virat Kohli"},{"quote":"I swear my car won't run unless I'm picking my nose: At least, I'm that superstitious about it, so I don't want to take any chances.","author":"Adam Carolla"},{"quote":"My first car was, as depicted in 'Sleepwalk with Me,' my mother's '92 Volvo station wagon that had 80,000 miles on it, and I had put 40,000 miles on it, so by the time it retired it had 120,000, and I basically killed it. It served me well, and my mechanic was always very angry with me because I just didn't properly care for it.","author":"Mike Birbiglia"},{"quote":"I'm someone who's always on the go and crazy busy, so I like to keep snacks in my car and at the office, and Cracker Jack'd is a really yummy snack that I love. I definitely am a big snacker.","author":"Ashley Tisdale"},{"quote":"I am endlessly busy, bringing up five young kids, and trying to keep up with the three older ones. I still spend most of my life driving car pools.","author":"Danielle Steel"},{"quote":"Either the car is stationary, or it's on the move.","author":"Murray Walker"},{"quote":"I'm a big believer in everybody being themselves. If not doing a swimsuit calendar is yourself, that's great. But if doing a swimsuit calendar is yourself, then you should be able to do it. What I do outside the car adds to who I am and expresses a different side of me.","author":"Danica Patrick"},{"quote":"Ten to 20 years out, driving your car will be viewed as equivalently immoral as smoking cigarettes around other people is today.","author":"Marc Andreessen"},{"quote":"A male gynecologist is like an auto mechanic who has never owned a car.","author":"Carrie Snow"},{"quote":"The first time I rode a bike I was four or five. I crashed into the back of a car.","author":"David Millar"},{"quote":"It was my father who instilled the 'never say no' attitude I carry around with me today, and who instilled in me a sense of wonder, always taking us on adventures in the car, never telling us the destination.","author":"Marlee Matlin"},{"quote":"I absolutely refuse to reveal my age. What am I - a car?","author":"Cyndi Lauper"},{"quote":"We had the guys from X Men 2 do the cameras. They had a 360 camera that would go from one car, up in the air and over to another car in a continuous shot while the film was still rolling, going 90 mph.","author":"Jimmy Fallon"},{"quote":"It's like driving your car. If you drive too fast on the highway, you will topple, so you better maintain your speed. Life is similar to that, and that's the way you have to control your head.","author":"A. R. Rahman"},{"quote":"By far my most perilous assignment was covering a tank car explosion.","author":"Jessica Savitch"},{"quote":"There are races and then there are races. And without a doubt, the Indy 500 is the race that I've always wanted to attend. And now, to be driving the Corvette Pace Car... this is going to be unbelievable.","author":"Guy Fieri"},{"quote":"In the car and in front of the camera I tend to be very calm but behind the scenes I can get fired up and passionate, I just don't see the need to shout my mouth off in public.","author":"Jenson Button"},{"quote":"I am thankful the most important key in history was invented. It's not the key to your house, your car, your boat, your safety deposit box, your bike lock or your private community. It's the key to order, sanity, and peace of mind. The key is 'Delete.'","author":"Elayne Boosler"},{"quote":"Maybe the bike is more dangerous, but the passion for the car for me is second to the bike.","author":"Valentino Rossi"},{"quote":"Most people have no concept of how an automatic transmission works, yet they know how to drive a car. You don't have to study physics to understand the laws of motion to drive a car. You don't have to understand any of this stuff to use Macintosh.","author":"Steve Jobs"},{"quote":"Many highly intelligent people are poor thinkers. Many people of average intelligence are skilled thinkers. The power of a car is separate from the way the car is driven.","author":"Edward de Bono"},{"quote":"Every kid has a toy that they believe is their best friend, that they believe communicates with them, and they imagine it being alive, their toy horse or car or whatever it is. Stop-motion is the only medium where we literally can make a toy come to life, an actual object.","author":"Henry Selick"},{"quote":"Racing is what I live for, and it makes my world go around. Having said that, without the support of the diabetes community, I may not have gotten back into the race car after my diagnosis in October 2007.","author":"Charlie Kimball"},{"quote":"Normal is getting dressed in clothes that you buy for work, driving through traffic in a car that you are still paying for, in order to get to a job that you need so you can pay for the clothes, car and the house that you leave empty all day in order to afford to live in it.","author":"Ellen Goodman"},{"quote":"Justice is expensive in America. There are no Free Passes... You might want to remember this, the next time you get careless and blow off a few Parking Tickets. They will come back to haunt you the next time you see a Cop car in your rear-view mirror.","author":"Hunter S. Thompson"},{"quote":"If you think nobody cares if you're alive, try missing a couple of car payments.","author":"Earl Wilson"},{"quote":"Once you become successful, people know where you live, the type of house you live in, the kind of car you drive, the clothes you wear, and so it would be patronising to go and talk like a welder. Welding's a mystery to me now. You can't go back, your life changes every day.","author":"Billy Connolly"},{"quote":"Riding my motorcycle around L.A. is like my own video game. But unlike many folks at the wheel, I am occupied with getting where I'm going and keeping myself safe. Most people are applying makeup, texting, and checking out the beauty in the next car.","author":"Hugh Laurie"},{"quote":"I'm a hard worker, and everything with me is, if I work hard, I should get paid for it. Everything with me, I try to symbolize something flashy like jewelry or a car. The rubbing hands is a symbol of hustling, so it goes back to the money.","author":"Birdman"},{"quote":"The Internet has made some phenomenal breakthroughs that are still only poorly understood in terms of changing people's ideas of us and them. If mass media, social isolation in the suburbs, alienating workplaces and long car commutes create a bunker mentality, the Internet does the opposite.","author":"Alex Steffen"},{"quote":"I never had the high-paying job or the company car. It took me over a decade to pay off my student loans. I never had to worry about where to dock my yacht to reduce my taxes.","author":"Christine O'Donnell"},{"quote":"See, when you drive home today, you've got a big windshield on the front of your car. And you've got a little bitty rearview mirror. And the reason the windshield is so large and the rearview mirror is so small is because what's happened in your past is not near as important as what's in your future.","author":"Joel Osteen"},{"quote":"Giving money and power to government is like giving whiskey and car keys to teenage boys.","author":"P. J. O'Rourke"},{"quote":"And suddenly I realised that I was no longer driving the car consciously. I was driving it by a kind of instinct, only I was in a different dimension.","author":"Ayrton Senna"},{"quote":"Nobody can ever make enough money for as many poor relatives as I've got. Somebody's got a sick kid, or somebody needs an operation, somebody ain't got this, somebody ain't got that. Or to give the kids all a car when they graduate.","author":"Dolly Parton"},{"quote":"I couldn't find the sports car of my dreams, so I built it myself.","author":"Ferdinand Porsche"},{"quote":"You always hear the phrase, money doesn't buy you happiness. But I always in the back of my mind figured a lot of money will buy you a little bit of happiness. But it's not really true. I got a new car because the old one's lease expired.","author":"Sergey Brin"},{"quote":"America... just a nation of two hundred million used car salesmen with all the money we need to buy guns and no qualms about killing anybody else in the world who tries to make us uncomfortable.","author":"Hunter S. Thompson"},{"quote":"When a man opens a car door for his wife, it's either a new car or a new wife.","author":"Prince Philip"},{"quote":"The world is full of abundance and opportunity, but far too many people come to the fountain of life with a sieve instead of a tank car... a teaspoon instead of a steam shovel. They expect little and as a result they get little.","author":"Ben Sweetland"},{"quote":"My very best friend died in a car accident when I was 16 years old. That was the hardest blow emotionally that I have ever had to endure. Suddenly, you realize tomorrow might not come. Now I live by the motto, 'Today is what I have.'","author":"Amber Heard"},{"quote":"My mom had me at 16 and took me every place she went. I remember going on peace marches. She tried to take me to Woodstock - it was pouring rain. It was on my birthday, and I was crying so much in the car they turned the car around and dumped me at my grandmother's house... I had a little attitude.","author":"Debi Mazar"},{"quote":"I am really interested in eccentric minds. It's rather like being fascinated by how cars work. It's really boring if your car works all the time. But as soon as something happens, you get the bonnet up. If someone has an abnormal or dysfunctional state of mind, you get the bonnet up.","author":"Mark Haddon"},{"quote":"Austin sounds a little bit like Aston Martin, which is the type of car James Bond would drive.","author":"Mike Myers"},{"quote":"The irony is that it was tougher to rent a car from Cerberus when it owned Alamo than to buy a semi-automatic. To rent a car, one had to provide ID, a drivers' license, and get insurance coverage. To buy a gun? Cash and carry, from the back of a station wagon at a gun show. No concerns about downstream liability or risk.","author":"Eliot Spitzer"},{"quote":"Fact: The new '90210' is cooler than the old '90210.' It's the lithe, streamlined Skipper to the elder series' venerable Barbie. Gone are the traditional parents - they've been replaced by a hipster mom n' pop who get busted necking in the car.","author":"Diablo Cody"},{"quote":"Back in the '60s, there was a car sticker that read, 'Forget Oxfam, Feed Twiggy,' but I ate like a horse.","author":"Twiggy"},{"quote":"A gun can be dangerous. But a gun can protect you, you can hunt for food with it - you know, the tool itself is a tool. The intention of the party using the tool is a part of the process, right? You know: the knife cuts the steak, stabs the person, saves somebody from danger, cuts somebody out of a car.","author":"Peter Guber"},{"quote":"My daughter Lila loves the smell of gasoline - she always says, 'Mummy, keep the door open,' when I'm filling up the car. I've heard it is one of the most preferred scents in the world - maybe that's something to study for my next fragrance!","author":"Kate Moss"},{"quote":"I wanted to send a message to the television industry that excitement is not made of car chases.","author":"Gene Roddenberry"},{"quote":"Faffing is good. It is an important part of life. Faffing is when we disconnect from the matrix and idle for a while, like a car. Our body and spirit know deep down that human beings were not made for constant toil so subconsciously creates space through the mechanism of faffing.","author":"Tom Hodgkinson"},{"quote":"I have a very tiny house in Burbank. I drive an 8-year-old car. I'm gonna drive it into the ground. I enjoy what I enjoy.","author":"Patton Oswalt"},{"quote":"Stay humble. Always answer your phone - no matter who else is in the car.","author":"Jack Lemmon"},{"quote":"Cyclists. I really hate them. I wish they would not be so self-righteous and realise they are a danger to pedestrians. I wish cyclists would not vindictively snap off wing mirrors on cars when they were trying to cross in front of the car at a danger to motorists and pedestrians.","author":"A. S. Byatt"},{"quote":"I really enjoy not getting in a car and running errands on bikes.","author":"Stone Gossard"},{"quote":"I would like you all to give me a round of applause as I have not crashed my car in over 15 months.","author":"Matthew Perry"},{"quote":"If I can put on my album in a car or on my headphones and listen to the whole thing and love it, that's what I'm going to be happy putting out there.","author":"Ed Sheeran"},{"quote":"You don't get a mix of ovals and road/street course racing with this level of competition and speed anywhere other than Indy Car, and I think that's why it has remained a popular choice for so many young drivers.","author":"Charlie Kimball"},{"quote":"I get labelled as just being about one thing, but there's lots of layers to what I do. It's just lazy journalism, but people start to accept it. If people spent an hour in my car driving around London and listening to the stuff I listen to, they'd hear some interesting stuff.","author":"Paul Weller"},{"quote":"If you were a kid in 1955, you would pick up a copy of 'Popular Science' and it would say, 'This is the kind of car you're going to be driving in five years or in 20 years you'll be able to take a jet plane from New York to London in four hours,' or something like that. We actually got used to the idea that the future's going to be different.","author":"David Gerrold"},{"quote":"The first trip I remember taking was on the train from Virginia up to New York City, watching the summertime countryside rolling past the window. They used white linen tablecloths in the dining car in those days, and real silver. I love trains to this day. Maybe that was the beginning of my fixation with leisurely modes of travel.","author":"Billy Campbell"},{"quote":"My dad always said that 90 percent of marital problems could be solved by getting your blood sugar up, and he's right! So I would say pick a partner who's forgiving when you have low blood sugar and threaten to drive your car through your shared home.","author":"Casey Wilson"},{"quote":"If your goal is to be the biggest movie star in the world, a 10-movie contract is gold. It was never my goal. Up until now, I made movies - and I have a nice house, a nice car. I'm fortunate, happy and grateful. Life is good.","author":"Chris Evans"},{"quote":"We always kept believing in ourselves and our team and the car.","author":"Sebastian Vettel"},{"quote":"L.A.'s kind of, like, seven really cool towns. It's so laid-back. If you go in the right spot, you can walk around, and you don't need a car.","author":"Julian Casablancas"},{"quote":"I like structure - like driving: go past the school on the street, stay on the right side, no hitting the car, go in right, you'll see a big church, stop and take a left, and you'll have it. By doing this I'm giving a structure of life, a path of light, and showing what happens between me and me, which is something very beautiful.","author":"Jean-Claude Van Damme"},{"quote":"I was turning 20 during my first record. Those decade birthdays always kind of cause me, it seems, to reflect, look back, and then look forward. I just was closing this period of my life where I was living in a car and scrambling my whole life to then signing a six-record deal with Atlantic.","author":"Jewel"},{"quote":"In the future, you'll simply jump into your car, turn on the Internet, turn on a movie and sit back and relax and turn on the automatic pilot, and the car will drive itself.","author":"Michio Kaku"},{"quote":"The car provided Americans with an enviable standard of living. You could not get a steady job with high wages and health and retirement benefits working on the General Livestock Corporation assembly line putting udders on cows.","author":"P. J. O'Rourke"},{"quote":"I'd really like to get the girl, shoot the gun, drive the car, have fun. I even have these kind of action dreams, where I'm the action guy.","author":"Kevin Bacon"},{"quote":"In 1964, when Lee Iacocca said, 'Shelby, I want you to make a sports car out of the Mustang,' the first thing I said was, 'Lee, you can't make a race horse out of a mule. I don't want to do it.' He said, 'I didn't ask you to make it; you work for me.'","author":"Carroll Shelby"},{"quote":"I want a pit crew... I hate the procedure I currently have to go through when I have car problems.","author":"Dave Barry"},{"quote":"Theater in New York is nearer to the street. In London, you have to go deep into the building, usually, to reach the place where theater happens. On Broadway, only the fire doors separate you from the sidewalk, and you're lucky if the sound of a police car doesn't rip the envelope twice a night.","author":"Tom Stoppard"},{"quote":"I dated a guy and he liked me but I didn't like him. I went through his wardrobe and cleaned out his house and got him to get a new car. He said to me, 'If I give you $10,000, will you find me my wife because I want someone like you?' And within a year, he got married. That was the first match that led to me leaving my corporate job.","author":"Patti Stanger"},{"quote":"I don't know how to drive a car.","author":"Javier Bardem"},{"quote":"When I was writing 'Kitchen Confidential,' I was in my 40s, I had never paid rent on time, I was 10 years behind on my taxes, I had never owned my own furniture or a car.","author":"Anthony Bourdain"},{"quote":"In theory, cars are fairly simple. If they don't start, it's either the fuel system or the electrical system. Teach yourself about the path of each in your engine and tracing it is fairly straightforward. But at the beginning, mastering each new system seems like an unreachable shore. The car is effectively a black box.","author":"Adam Savage"},{"quote":"In Paris, one is always reminded of being a foreigner. If you park your car wrong, it is not the fact that it's on the sidewalk that matters, but the fact that you speak with an accent.","author":"Roman Polanski"},{"quote":"When I do retire, I know for a fact that I'll never be able to replace the incredible feeling I get when I'm driving an F1 car.","author":"Jenson Button"},{"quote":"You can't develop a great car and sell it as an independent. You can develop a great car and make a deal with Mercedes.","author":"Eric Fellner"},{"quote":"In the heat of the Russian summer a sleeping car is the most horrible instrument of martyrdom imaginable.","author":"Manfred von Richthofen"},{"quote":"When I go to Indian reservations in the West, and especially to the Pine Ridge Reservation, I sometimes feel unsure where to put my foot when I open the car door. The very ground is different from where I usually stand. There are fewer curbs, fewer sidewalks, and almost no street signs, mailboxes, or leashed dogs.","author":"Ian Frazier"},{"quote":"When Ford sells a car, a dealer isn't allowed to take out the engine and put a different one in. When a newsstand sells the Washington Post, no one can go to the newsstand and pay them to rip out the classified section and put their own classified section in - if they could, they would do so.","author":"Bill Gates"},{"quote":"It goes without saying that you should never have more children than you have car windows.","author":"Erma Bombeck"},{"quote":"Things in themselves have no life in them. A car can't comfort or encourage you. A house means nothing if there's no life and love inside.","author":"Joyce Meyer"},{"quote":"My mom always makes the whole family pile into the car and drive around to look at the Christmas lights. My brother and I never want to do it, but my mom just loves it!","author":"Debby Ryan"},{"quote":"(On seeing a former lover for the first time in years) I thought I told you to wait in the car.","author":"Tallulah Bankhead"},{"quote":"I remember at the age of five travelling on a trolley car with my mother past a group of women on a picket line at a textile plant, seeing them being viciously beaten by security people. So that kind of thing stayed with me.","author":"Noam Chomsky"},{"quote":"I had a friend who was a plastic surgeon, so he would do little things. I never had, like, a full thing. So I would go in maybe once every two or three years, and he'd do a little here, a little there; tweak you, like you tweak your car. Then I became the plastic surgery poster girl.","author":"Joan Rivers"},{"quote":"By the end of the 1950s, American cars were so reliable that their reliability went without saying even in car ads. Thousands of them bear testimony to this today, still running on the roads of Cuba though fueled with nationalized Venezuelan gasoline and maintained with spit and haywire.","author":"P. J. O'Rourke"},{"quote":"A car is useless in New York, essential everywhere else. The same with good manners.","author":"Mignon McLaughlin"},{"quote":"I'm gonna be making records anyway, even if I had to sell 'em out of the trunk of my car. I'm that kind of musician and singer.","author":"Dolly Parton"},{"quote":"It all happened so fast. The ghetto. The deportation. The sealed cattle car. The fiery altar upon which the history of our people and the future of mankind were meant to be sacrificed.","author":"Elie Wiesel"},{"quote":"I think we've been dulled by capitalism. We're just blobs now - we're so worried about how we can keep paying the lease on the car, the mortgage, the lease on the toaster and all that. You can't really think about much else. If you lose that, you lose the whole lot.","author":"Rupert Everett"},{"quote":"The people who criticise you will not be the ones taking care of your legs when you are in your wheelchair. People who never drove a car in these conditions, they just don't know.","author":"Alain Prost"},{"quote":"I love Lady Antebellum and Miranda Lambert - they write from the heart. But it's hard to find a country music lover in L.A. None of my friends really listen to it, and they hate getting in the car with me because I just blast Taylor Swift.","author":"Lucy Hale"},{"quote":"I lived on the top of one hill and the school was at the top of another hill. Nobody ever went to school by car - we didn't have any cars during the war. So that to and from school was itself a training.","author":"Roger Bannister"},{"quote":"I grew up with the Highwaymen, which was Johnny Cash, Willie Nelson, Waylon Jennings and Kris Kristofferson. Mom and Dad rode rodeo, so country music was always in the house and the car. They threw in some Dolly Parton, too.","author":"Christian Kane"},{"quote":"I'm not going to just stop doing it because I got hurt once. People get hurt in car wrecks every day, and they don't stop driving the car the rest of their life to work. It's my passion. It's what I want to do with my life. It's a part of what I do.","author":"Tony Stewart"},{"quote":"I hate to take compromises with a racing car. The more standard a car is, the more compromises you have to take.","author":"Michael Schumacher"},{"quote":"I promise you a police car on every sidewalk.","author":"Marion Barry"},{"quote":"Long practise in driving a racing car at a hundred miles an hour or so gives first-class training in control and judging distances at high speed and helps tremendously in getting motor sense, which is rather the feel of your engine than the sound of it, a thing you get through your bones and nerves rather than simply your ears.","author":"Eddie Rickenbacker"},{"quote":"I like to sing around the bonfire, in my car and in the shower.","author":"Jessica Pare"},{"quote":"My dad loved to 'arrange things' to take us kids to that scared the crap out of us on Halloween. He'd take us to the old 'Hermit's House' at the edge of town. He'd park the car 100 yards down the street and say, 'Go back there and get something off the front porch!'","author":"Bill Moseley"},{"quote":"My sporting hero was Drazen Petrovic, the NBA basketball player, who was killed in a car accident in 1993. He was a good friend, an unbelievable player, and I dedicated my Wimbledon win to him.","author":"Goran Ivanisevic"},{"quote":"I was perhaps about 10 years old when a local farmer rang us up to say he had found a young badger and would we take it in. So we did; it was a female called Bessy and she lived in the boiler room. She was extremely intelligent, had a very low opinion of cats but loved the dogs. She was pretty well trained; she went in the car.","author":"Owen Paterson"},{"quote":"We go through the whole season working on next season's car and developing the car and making sure we fit in the car and all that sort of stuff. And we obviously give ideas of what we would hope next year's car would have even if it's small things like buttons on the steering wheel and different positions and whatever.","author":"Jenson Button"},{"quote":"The very first time I was on a car in Atlanta, I saw the conductor - all conductors are white - ask a Negro woman to get up and take a seat farther back in order to make a place for a white man. I have also seen white men requested to leave the Negro section of the car.","author":"Ray Stannard Baker"},{"quote":"I allow myself one nice car.","author":"Slash"},{"quote":"I definitely love that all these car brands are coming out with hybrid forms of every car that they have. It's very awesome because I think it does make a difference, and it doesn't hurt that you save a lot of money on gas.","author":"Lucy Hale"},{"quote":"People would say you look weak if you're not cursing the opposition and driving around in a big black car while always wearing a tie. Above all, to be 'strong' you're always supposed to be giving orders.","author":"George Papandreou"},{"quote":"I grew up in Texas, and people love their American-made muscle cars there. I grew up around people who loved cars and took care of cars and my dad's a big car nut, so I learned a little bit about cars - how to love them, most importantly. I think that from the time I could remember, I've always envisioned myself in a vintage muscle car.","author":"Amber Heard"},{"quote":"One of my biggest problems this season was with the clutch at the start of the race. I hate to risk the car.","author":"Alain Prost"},{"quote":"My uncle was the first brown person to have a market stall on Petticoat Lane in the 1960s. He worked his way up from the street. He was homeless, but eventually he got a car so he could sell from the boot. And by the 1980s, he was a millionaire wholesaling to companies like Topshop. So in a way, fashion put me in England.","author":"M.I.A."},{"quote":"All in all it was a smooth race, the car was very well balanced. I'm very proud to be the first winner here in India.","author":"Sebastian Vettel"},{"quote":"Qualifying is all about putting everything that you have and that the car has in one lap. It's like a rush, I really enjoy that.","author":"Sebastian Vettel"},{"quote":"If you or me go to the gas station to fill up our car and it costs us much more than we expected, it will zap our discretionary income. We won't have the extra money to buy that washing machine or new winter coat-all big ticket items that are important to economic growth.","author":"Maria Bartiromo"},{"quote":"Of course, I'm older now. I'm in a different place in my life than when I wrote the songs for 'Car Wheels' or 'Essence' or whatever. Different things were going on.","author":"Lucinda Williams"},{"quote":"Because I'm a young black man driving a really nice, expensive car, I sometimes get harassed when I'm rolling through a ghetto neighbourhood.","author":"Coolio"},{"quote":"I don't mean to in any way impugn the makers of Bentley, but that car is nuts. When I do drive, I drive a Toyota Prius. So driving around the streets of Albuquerque in a Bentley made me feel so fake-a-rooney.","author":"Jessica Hecht"},{"quote":"My personal fascination with the power of the crowd has been growing: Exactly what can a 'crowd' accomplish? We know crowds can raise billions of dollars, create Wikipedia, and even design and build small autonomous drones. But how about something large and complex like designing a new car, and maybe someday even a spaceship?","author":"Peter Diamandis"},{"quote":"I was kidnapped by Sunni insurgents near Fallujah, in Iraq, ambushed by the Taliban in the Korengal Valley in Afghanistan, and injured in a car accident that killed my driver while covering the Taliban occupation of the Swat Valley in Pakistan.","author":"Lynsey Addario"},{"quote":"The police pull up in back of my car and run my plates - they don't see you as you are; they see you through a racialized negative gaze. I think the best thing is not to internalize it too much, or it'll make you crazy because you know it's going to happen again.","author":"Mark Bradford"},{"quote":"I don't have a car in Manhattan because you have to choose between a car and an apartment. It's that expensive.","author":"Adam Ferrara"},{"quote":"We lived by very complex import and export policies, a very complex industrial licensing regime. Very few people could get licences, which were required right from manufacturing a pin to manufacturing a car, and generally went to people who found favour with the government.","author":"Sunil Mittal"},{"quote":"Removing the faults in a stage-coach may produce a perfect stage-coach, but it is unlikely to produce the first motor car.","author":"Edward de Bono"},{"quote":"That's the first sign you know you're a Libertarian. You see the red light. You stop. You realize that there's not a car in sight. And you put your foot on the gas.","author":"Gary Johnson"},{"quote":"Accidents happen, whether they're car accidents, friendly fire, drug overdoses. Accidents happen, and they're tragic. It's like a bomb that goes off and pieces of shrapnel rip into the flesh of the family. It's the families that need the compassion, because everywhere they walk, every day, someone reminds them of their loss.","author":"James Belushi"},{"quote":"When billionaire car dealers or manufacturers pay for ambassadorships, at least they pay with money earned by selling something of value.","author":"Elizabeth Warren"},{"quote":"I want a Mini-Cooper because it's fuel efficient, emissions efficient and all that stuff. It's small and better for the environment. I think that will be my next car.","author":"Christina Ricci"},{"quote":"We've seen computers play chess and beat grand masters. We've seen computers drive a car across a desert. But interestingly, playing chess is easy, but having a conversation about nothing is really difficult for a computer.","author":"Hod Lipson"},{"quote":"It isn't unusual to see children climb into a car every morning to be ferried to the front door of a school that's just a few blocks away.","author":"Risa Lavizzo-Mourey"},{"quote":"In life, you need a house and a car. After that, you have a choice.","author":"Xavier Niel"},{"quote":"Some people treat seeing me as if they just won a car on 'The Price is Right.' The feet get going, and the hands start flapping, and it's really quite amazing. It's a little scary: you can't have more than two or three of them at the same time because someone might get hurt. But it's great fun.","author":"John Schneider"},{"quote":"It's strange that we create tech and then we apply it to machines, when we could apply it to ourselves. Cars can now detect if something is behind them, but we don't have this ability. Why are we applying such a simple sense to a car when we could apply it to ourselves?","author":"Neil Harbisson"},{"quote":"If you don't drink, smoke, or drive a car, you're a tax evader.","author":"Thomas S. Foley"},{"quote":"We have an uncanny ability to make birds do what we want them to do. In Blood Simple there's a shot from the bumper of a car and it's going up this road and a huge flock of birds takes off at the perfect moment.","author":"Joel Coen"},{"quote":"I look away at car crashes, and I know people who look away at car crashes, because it makes us uncomfortable to watch other people in pain.","author":"John Mayer"},{"quote":"In survey after survey, people report that the greatest dangers they face are, in this order: terrorist attack, plane crashes and nuclear accidents. This despite the fact that these three combined have killed fewer people in the past half-century than car accidents do in any given year.","author":"Will Self"},{"quote":"My worst ever car was a green Datsun B210, back when they called it 'Datsun' - now it's 'Nissan.' Very unsexy, unattractive. Girls hated the car. I was embarrassed to even be in it... but it was my transportation.","author":"Ice Cube"},{"quote":"I will argue that in the literal sense the programmed computer understands what the car and the adding machine understand, namely, exactly nothing.","author":"John Searle"},{"quote":"The prenup needs to be drawn up months before the wedding, not days - it's not something you slap together and sign in the car on the way to the ceremony. A shotgun prenup might not hold up in court.","author":"Suze Orman"},{"quote":"A suburban mother's role is to deliver children obstetrically once, and by car forever after.","author":"Peter De Vries"},{"quote":"First of all, I have to have trucks because I live most of my time on a horse farm, so I've gotta have trucks. It's in the northeast; I've got to have pickup trucks to move snow, number one. Number two, just if I'm driving, I don't have to have an SUV, but I want a big car.","author":"Denis Leary"},{"quote":"We've become such a multitasking society that just paying attention to the road doesn't seem to be that important anymore. I have to remind my kids all the time that that's what you're supposed to be doing in the car.","author":"Andie MacDowell"},{"quote":"I live in a kind of gay bubble. I live in a gay house, I drive a gay car. I eat gay food.","author":"Julian Clary"},{"quote":"I think, like everybody else in New Hampshire, when I pull up to fill up my car and I pay $50, I get upset. And I'm wondering if these prices are legitimate.","author":"Judd Gregg"},{"quote":"If you think about computing, there isn't just one way to compute, just like there's not just one way to move around. You can have shoes, you can have a car, you can have a bicycle, submarine, rocket, plane, train, glider, whatever. Because you have one doesn't mean you get rid of another one... But PCs continue to be important.","author":"Michael Dell"},{"quote":"On my job I end up jumping out of planes. Last week I got in an 18-wheeler and drove down a runway onto a skid track. The week before that they put me in a car and sunk me to the bottom of a lake to see if I could escape without an oxygen tank.","author":"Rick Mercer"},{"quote":"The reason I keep talking about a wife and saying the word 'wife' on stage is because it seems a funny word to me. The more you say it, the more it seems to detach from that person and become this sort of abstract thing: that you would set out to find a wife, that it would be an objective like buying a new car.","author":"Stephen Merchant"},{"quote":"Boys, they can't take my refrigerator now. They'll never get my car now. I paid cash for 'em and they're mine, and I'm keepin' 'em!","author":"Patsy Cline"},{"quote":"Well, you can say there is a self driving car. I'm seeing the automation of vehicles. Really, computer-assisted driving. I think that is really interesting to us because we are taking all of the sensors technologies and putting them in cars and making people safer.","author":"Tony Fadell"},{"quote":"When I have to do something fast, I wear the most unflattering rubber pants over my pants and a big easy sweater. I can get on my knees in the garden in whatever condition, and when I'm done, I can take it off, get in the car, and drive to the office. It's the most practical thing.","author":"Dries van Noten"},{"quote":"When you're doing a TV show, it's not like you just shoot for six weeks and you're in an editing room with all of your footage. It's like a guitar or a car, you have to fine tune things. You stop doing what's not working, you work on what is working and you add things that do work.","author":"Chris Pratt"},{"quote":"I live a fairly simple life, and that didn't change much after I sold TechCrunch in 2010. I didn't buy a new house or even a new car. The one thing I did splurge on was a boat. Nothing too fancy or large.","author":"Michael Arrington"},{"quote":"They put chains on me; they chained my waist, my legs. Put me in the back of a squad car, and I literally blacked out. I didn't even - there's whole pieces missing.","author":"Jim Bakker"},{"quote":"I'd had a really bad car accident years ago, and basically, the ligaments in the back of my neck were ripped, and I'd never addressed that.","author":"Jennifer Grey"},{"quote":"I think cars encapsulate the history of innovation and style - it's the other side of the coin of the car being public enemy No.1.","author":"Norman Foster"},{"quote":"Guys want a 500 horsepower car. I'd rather have one horsepower - in a horse. That's macho. You go to pick up your date and you show up on a horse.","author":"Bryan Callen"},{"quote":"Men are superior to women, for one thing they can urinate from a speeding car.","author":"Will Durst"},{"quote":"I've made club songs, and I've made radio songs, and I've made the car songs.","author":"T-Pain"},{"quote":"The serenity prayer, 'God grant me the strength to accept...' That's a prayer that's actually in my car. I say it every day.","author":"Lauren London"},{"quote":"When there's not ten feet of snow on the ground, I ride my bike down the streets of New York, and I literally hear two things out of car windows as cabs pass by me: They either yell, 'Hey, dummy,' or 'Hey, Mayhem.'","author":"Dean Winters"},{"quote":"For me, being in a car or on an airplane is like being in limbo. It's this dead zone between two places. But to walk, you're some place that's already interesting. You're not just between places. Things are happening.","author":"Rebecca Solnit"},{"quote":"When I grew up there wasn't air-conditioning or anything of that nature, and this old car had a wall thickness of about ten inches. So we had a little warmer house in the winter and a little cooler in the summer.","author":"Merle Haggard"},{"quote":"Every business decision I ever made I learned from my grandfather Papa Sam. He moved here from Russia when he was a boy. He worked his way up selling newspapers and ladies' handbags, and eventually, he became Cadillac Sam, one of the biggest car dealers in Chicago.","author":"Bobbi Brown"},{"quote":"You know, it's amazing. I don't even have a car, would you believe it? I had a motorbike and it got stolen last year. So I've got to buy another one of those, I suppose. I can treat myself to that.","author":"Michael Fassbender"},{"quote":"I had a '56 Ford, and my first car was a '49 Chevy. I converted it to a stick and used to race with the other high school kids down along the river.","author":"Craig T. Nelson"},{"quote":"I've been driving in the city for years because, as a stand-up in N.Y.C., you can perform at more comedy clubs a night if you have a car. Getting from club to club by subway is too slow at night and too expensive by cab. So, many comics live far out from Manhattan and drive in every night.","author":"Judah Friedlander"},{"quote":"Sometimes, I'm driving along in my car, and a song from my high-school years comes on the radio: Springsteen's 'Thunder Road.' Just the opening few chords make me want to roll down the window and let the wind blow back my hair.","author":"Dani Shapiro"},{"quote":"There are many people in the world who feel that if only they had a bigger car, a nicer house, better vacations, a more understanding boss, or a more interesting partner, then their life would work. We all go through that one. Slowly we wear out most of our 'if onlies.'","author":"Joko Beck"},{"quote":"In real life, one of my friends was killed in a car accident during our sophomore year.","author":"Beverley Mitchell"},{"quote":"After leaving school, I travelled around Europe for about six months. In Denmark, I thought that was my chance to get an amazing haircut, so I went to what I thought was a great hairdresser. It turned out to be the car wash of hairdressers, and I walked out sporting yet another pudding bowl, but this time with a stripe bleached down the centre.","author":"Becki Newton"},{"quote":"To understand the intensity of driving an F1 car, you have to be in it. When you're driving a 750hp machine at 200mph, the noise and the vibrations are incredible. The G-force when you take big corners is like someone trying to rip your head off. You hit the brakes, and it feels as if the skin is being pulled off your body.","author":"Jenson Button"},{"quote":"My kids always perceived the bathroom as a place where you wait it out until all the groceries are unloaded from the car.","author":"Erma Bombeck"},{"quote":"Whether you live in a city or a small town, and whether you drive a car, take the bus or ride a train, at some point in the day, everyone is a pedestrian.","author":"Anthony Foxx"},{"quote":"My approach is to start from the straightforward principle that our body is a machine. A very complicated machine, but none the less a machine, and it can be subjected to maintenance and repair in the same way as a simple machine, like a car.","author":"Aubrey de Grey"},{"quote":"I used to look like a deer in headlights on the red carpet. You step out of the car and it's bedlam. Everyone's got crazy eyes.","author":"Emily Blunt"},{"quote":"My favorite affirmation when I feel stuck or out of sorts is: Whatever I need is already here, and it is all for my highest good. Jot this down and post it conspicuously throughout your home, on the dashboard of your car, at your office, on your microwave oven, and even in front of your toilets!","author":"Wayne Dyer"},{"quote":"Anything that's different from your own realm of experience as a human being, whether it's driving a car or a boat, or using guns, anything that separates you from yourself and leads you more towards this character's existence is a big help.","author":"Colin Farrell"},{"quote":"In New York, you've got Donald Trump, Woody Allen, a crack addict and a regular Joe, and they're all on the same subway car.","author":"Ethan Hawke"},{"quote":"I've always wanted to buy a sports car. After the England series, I went up to my dad and said that I wanted to buy a sports car and got his consent. On his birthday, I surprised him by bringing it home. It's a Porsche Boxter Limited Edition, and my family was thrilled to see it.","author":"Suresh Raina"},{"quote":"I enjoy racing historic motorcars from the '50s and '60s. The seed of my interest was planted when I was about 12 years old and took over my mother's Morris Minor. I drove it around my father's farm. But my favorite car is still a McLaren F1, which I have had for 10 years.","author":"Rowan Atkinson"},{"quote":"Before now, I've always taken my mixes out to the car and listened to them in the parking lot. I still do that, but more so now I'm listening to it on the Beat box, and I think people should give it at least a listen and check it out and see what it is.","author":"Dr. Dre"},{"quote":"A perfect day would be to get into the car, drive out to Yosemite and go camping.","author":"Michael Steger"},{"quote":"Canadians can easily 'pass for American' as long as we don't accidentally use metric measurements or apologize when hit by a car.","author":"Douglas Coupland"},{"quote":"American stuntmen are smart - they think about safety. When they do a jump in a car, they calculate everything: the speed, the distance... But in Hong Kong, we don't know how to count. Everything we do is a guess. If you've got the guts, you do it. All of my stuntmen have gotten hurt.","author":"Jackie Chan"},{"quote":"Now that I'm a grandfather myself, I realize that the best thing about having grandkids is that you get the kid for the best part of the ride - kind of like owning a car for only the first 10,000 miles. You can have your grandchildren for a couple of days and then turn them back over to the parents.","author":"Willard Scott"},{"quote":"I'm very free-spirited and crazy. I love to have fun, and I like doing stupid things. At the same time, I'm like a 35-year-old. I have a house. I have a car. I have a steady job. I have a business, and I have to make serious decisions.","author":"Avril Lavigne"},{"quote":"My first car was a motorcycle.","author":"Adam Carolla"},{"quote":"When consumers purchase a Toyota, they are not simply purchasing a car, truck or van. They are placing their trust in our company.","author":"Akio Toyoda"},{"quote":"Police departments no longer have to pay overtime or divert resources from other projects to find out where an individual goes - all they have to do is place a tracking device on someone's car or ask a cell phone company for that individual's location history and the technology does the work for them.","author":"Ron Wyden"},{"quote":"Well, you go to Holland and everybody's on a bike - nobody would think to have a car.","author":"Stone Gossard"},{"quote":"If I test the car for a year I can be quite competitive the next season.","author":"Valentino Rossi"},{"quote":"You always want to have a winning car, but there is no guarantee that it will be.","author":"Kimi Raikkonen"},{"quote":"I will never shave off my beard and moustache. I did once, for charity, but my wife said, 'Good grief, how awful, you look like an American car with all the chrome removed.'","author":"Rolf Harris"},{"quote":"Any eyes on me - a late-night street sweeper, some dude texting in his parked car, the homeless guy talking to himself - make me feel uncomfortable when I skate. Everyone expects me to do certain things.","author":"Rodney Mullen"},{"quote":"We are all advertising, all of the time. If you want to sell your car, what do you do? You clean and polish it and make it the best you can. Some people bake bread when they are trying to sell their house because the smell adds a friendly feeling. Even the priest, with all his or her fervour, is advertising God. Everybody is selling.","author":"Paul Arden"},{"quote":"Have you heard about the Irishman who reversed into a car boot sale and sold the engine?","author":"Frank Carson"},{"quote":"That's what I love. Not being interrupted, sitting in a car by myself and listening to music in the rain. There are so many great songs yet to sing.","author":"Alison Krauss"},{"quote":"I think the Smart Car is awesome. The only problem is I've been on the freeway and felt like I was going to be blown away like a Tim Hortons coffee cup, so I may have to upgrade to a Mini Cooper - something a little stronger.","author":"Ellen Page"},{"quote":"The fast, flowing parts, the high-speed corners, that's where a Formula One car is at its best - changes of direction, pulling high g-forces left and right.","author":"Jenson Button"},{"quote":"You're pulling 4-5G for a lot of the corners around the lap. We build up lactic acid because there are a lot of vibrations in the car, and you have to have strong legs to hit the brake pedal. We need to be fit to do every lap at 100%.","author":"Jenson Button"},{"quote":"I would love to fall in love and get married and have beautiful children. I mean that's one of the goals in life, I think, to have, and it's a beautiful thing. My sister has kids and all my friends have kids. They show me their, you know their report cards. And I can show them my sports car.","author":"Tiesto"},{"quote":"I didn't get my first car until I was 22. It was a BMW 1602 and now I've got it back I'm waiting to restore it.","author":"Jay Kay"},{"quote":"I clipped a Ferrari, hit the gravel trap at a fair old speed, which lifted the car up into the barrier, and then rolled a few times. I had no injuries or anything - I just had to wait for the marshals to right the car before I could get out.","author":"Allan McNish"},{"quote":"When you walk the track and you see a corner and realise you were going round it at 160mph, you wonder who could be so stupid to take a corner at that speed. But in the car, you don't even think about that.","author":"Sebastian Vettel"},{"quote":"I've always saved. I believe in keeping money back for a rainy day and living within my means. I don't buy expensive clothes; I have a 10-year-old car I'm hoping to replace when a big job comes in. I suppose when we do go on family holidays, I am quite happy to spend when we are there.","author":"Sanjeev Bhaskar"},{"quote":"I've always had an affinity and a passion for cars and that whole car culture.","author":"Ludacris"},{"quote":"I did this Super-8 film at art school called 'Tissues,' this black comedy about a family whose father has been arrested for child molestation. I was absolutely thrilled by every inch of it, and would throw my projector in the back of my car and show it to anybody who would watch it.","author":"Jane Campion"},{"quote":"I've got Asperger's syndrome and I'm not a very good people person, so I've always been more comfortable around machinery. Not in a weird way - I don't want to marry my car or anything stupid like that!","author":"Gary Numan"},{"quote":"So then I started doing a lot of episodic TV, just car chases or helicopter chases or whatever.","author":"David R. Ellis"},{"quote":"My dad died when I was 23. His death was sudden and shocking - the result of a car crash - and I never got to say goodbye.","author":"Dani Shapiro"},{"quote":"I have mixed feelings about 'Car 54, Where Are You?' Because we shot it as a musical and whoever the studio head was at Orion, or whoever the powers that be were, cut all but, like, two musical numbers out of it. That is the same as cutting the musical numbers out of 'The Wizard Of Oz'; it wouldn't be that interesting.","author":"John C. McGinley"},{"quote":"I think most Hollywood meetings are silly and I truly despise pitching. It's insane to expect someone to come in and tell you the story before they've written it, and buying an idea from someone who can explain it rather than write it is like choosing a mechanic based on his ability to draw a picture of your car's problem.","author":"Jess Walter"},{"quote":"You cannot drive the car if you do not have a driver's license. You cannot do brain surgery if you are not a brain surgeon. You cannot even do a massage if you don't have a license.","author":"Bikram Choudhury"},{"quote":"The only thing I do on a computer is play Texas Hold 'Em, really. Obviously my cell phone is a computer. My car is a computer. I'm on computers every day without actively seeking them out.","author":"John Hawkes"},{"quote":"I like the guy who reads. Being articulate is something that's very important to me. But you need to know how to chop wood and fix a car and do guy things. I didn't grow up with spectators. Nobody was a spectator.","author":"Hilarie Burton"},{"quote":"A private railroad car is not an acquired taste. One takes to it immediately.","author":"Eleanor Robson Belmont"},{"quote":"I had the notion that, OK, so now we have all of this wealth, we could buy not only one expensive car, we could buy all of them. As soon as you realize that you could buy all of them, then none of them are particularly interesting or satisfying.","author":"Pierre Omidyar"},{"quote":"One time, I was posing on a car for a calendar shoot. I was doused with oil and literally slid off the car, bikini, heels and all!","author":"Candace Kita"},{"quote":"The Ford Flex is a really, really cool car. You get inside and you have so much headroom and it's really comfortable to drive and it's real techy inside. You look at the screen and it's blue and you've got all kinds of controls. Everything is digital.","author":"Gabriel Iglesias"},{"quote":"I don't purposely speed, but I might go over by five or six miles an hour from time to time. It doesn't give me a buzz driving on normal roads, because I can't go fast enough. It's never going to be anything like an F1 car.","author":"Jenson Button"},{"quote":"It wasn't a secret that I was gay. I'd come out to my parents during my junior year of high school, on the day that I also wrecked the family car.","author":"Mary Cheney"},{"quote":"Of the seven deadly sins, anger has long been the one with the best box of costumes. When the guy in the next car rages at you, he's dangerous. When you rage at him, you're just. We can usually recognize the results of anger, especially in others, as destructive and evil.","author":"Frederica Mathewes-Green"},{"quote":"I could be on 52nd and Third in Manhattan up and ask a strange for directions and they will help you, that's a rural heart. Your car breaks down in the middle of Iowa or somewhere, or Tennessee where I'm from, people want to help each other. Given each opportunity, you see how people come together.","author":"Rodney Atkins"},{"quote":"When I pull into a city and I rent a car and it's Nashville, or it's London, or I'm driving in the taxi to the hotel, and on comes one of my songs, it's like, 'Oh my God, they're still playing these songs on the radio.' And you still feel tearful and very grateful that somebody still likes these songs that you made up.","author":"Randy Bachman"},{"quote":"The racing driver's mind has to have the ability to have amazing anticipation, coordination, and reflex. Because of the speed the car goes.","author":"Emerson Fittipaldi"},{"quote":"All the times being like, 'Who rented this car and why are we going to this place?' You take the easy route and go, 'Oh, thanks for the champagne. I'll have another.'","author":"Rosario Dawson"},{"quote":"Like all kids who want to be in action movies, I want to jump out of a speeding car, shoot guns, slide out the side in slow motion like a John Woo movie.","author":"Dallas Roberts"},{"quote":"Some people say it might be good for your career to die and then come back again. I have died many ways, car crashes, motorcycle crashes, etc. But, I am still alive.","author":"Mark-Paul Gosselaar"},{"quote":"I'm in my father's car at age 9 or 10 crying to Leonard Cohen's 'Famous Blue Raincoat,' thinking that you could write nearly a love letter to a man who betrayed you by having an affair with your wife. I was thinking how wonderful and pure music can be for explaining situations.","author":"Lou Doillon"},{"quote":"My first car was a 1976 Toyota Corolla Liftback in red, like the one in 'The Blues Brothers.' I painted a Union Jack on the roof. I was absolutely in love with it until I destroyed it, which broke my heart!","author":"Richard Hammond"},{"quote":"Now having said that, I realize that releasing a film in the real world is like trying to get General Motors to release a handmade car.","author":"Godfrey Reggio"},{"quote":"Al Gore, the former vice-president of the United States, lives in a mansion that uses more electricity than the average family's bungalow! David Suzuki rides on a bus that uses more fuel than a Smart car to get across Canada! Oh my God! And this is just the tip of the vanishing iceberg!","author":"Linwood Barclay"},{"quote":"I grew up in Texas and we used to go to Padre Island, eight hours in the car down to the beach.","author":"St. Vincent"},{"quote":"I remember when metal was something you really had to search out, and now I hear it on car commercials.","author":"Trevor Dunn"},{"quote":"What I enjoy doing more than anything is, I have my little antique car collection, and when the weather is pretty I like to get out one of my old cars. I have a little route I run down in the country, down Nachez Trace Parkway. The loop down through there is just really relaxing, not much traffic.","author":"Alan Jackson"},{"quote":"After I joined Toyota, there was a period when I drove more than 200 cars in one year - different types, other companies' cars. I want to be able to tell what distinguishes one car from the next.","author":"Akio Toyoda"},{"quote":"I'd rather drive the yellow brick road, you wouldn't happen to know of a rental car place around.","author":"Ryan Stiles"},{"quote":"Some people think my father was a spy, because of working for that government agency in Vietnam, but he can't find his car keys, much less keep a national secret.","author":"Lauren Graham"},{"quote":"In the early nineties, I was a cub reporter on a city newspaper in Limerick, and assigned to the courthouse there. One day, an old detective sergeant came and whispered to me in the press pit. He pointed out a young offender, a teenager who was up for stealing a car or something relatively minor, and said, 'See this kid? He'll kill.'","author":"Kevin Barry"},{"quote":"When I first drove my car down Sunset Strip, I nearly crashed my car gazing at the monolithic ads of various celebrities. They are bigger than King Kong, and more frightening.","author":"Rebecca Pidgeon"},{"quote":"Mayors could never get away with the kind of nonsense that goes on in Washington. In our world, you either picked up the trash or you didn't. You either moved an abandoned car or you didn't. You either filled a pothole or you didn't. That's what we do every day. And we know how to get this stuff done.","author":"Michael Nutter"},{"quote":"I don't drive around London much. Any journey around Islington involves hundreds of speed bumps that seem to tear the bottom of your car off.","author":"Alan Davies"},{"quote":"I remember having my father stand over me when I had driven over my own foot; one leg was out of the car and one leg was in the car. He looked at me and told me that I was a drunk and that he was ashamed to call me his son. That night, I stopped drinking and I never drank again; I was twenty four.","author":"Randy Bachman"},{"quote":"If I start outsourcing all my navigation to a little talking box in my car, I'm sort of screwed. I'm going to lose my car in the parking lot every single time.","author":"Ken Jennings"},{"quote":"I think music can really affect people's emotions and, when I am about to get into a race car, I definitely listen to music with a good beat - that's when you've got the adrenalin pumping. And the time before you go into a race weekend, you have a lot of emotion and adrenalin, and a lot of focus.","author":"Allan McNish"},{"quote":"Because of that I don't care when I read in the newspaper that I am colourblind. I went through a red light in my car and I stopped when I before a green light. So I must be really colourblind, eh?","author":"Ruud van Nistelrooy"},{"quote":"Driving race cars was an avenue for me to learn how to build my own car, and that was my ambition all along.","author":"Carroll Shelby"},{"quote":"Americans are the only people in the world known to me whose status anxiety prompts them to advertise their college and university affiliations in the rear window of their automobiles.","author":"Paul Fussell"},{"quote":"Why did they keep changing guitars and amplifiers when they were perfect? They did the same things with cars, if you ask me. They forgot how to make them right, because they focused on style and bells and whistles.","author":"Buddy Guy"},{"quote":"People are so bad at driving cars that computers don't have to be that good to be much better. Any time you stand in line at the D.M.V. and look around, you're like, Oh, my God, I wish all these people were replaced by computer drivers.","author":"Marc Andreessen"},{"quote":"I think all males from Detroit have an obsession with cars.","author":"Dax Shepard"},{"quote":"I think we have to act like stars because it is expected of us. So we drive our big cars and live in our smart houses.","author":"Maurice Gibb"},{"quote":"See, what you're meant to do when you have a mid-life crisis is buy a fast car, aren't you? Well, I've always had fast cars. It's not that. It's the fear that you're past your best. It's the fear that the stuff you've done in the past is your best work.","author":"Robbie Coltrane"},{"quote":"I have a need to make these sorts of connections literal sometimes, and a vehicle often helps to do that. I have a relationship to car culture. It isn't really about loving cars. It's sort of about needing them.","author":"Matthew Barney"},{"quote":"I'm an anorak. I've always been an obsessive collector of things. Richard Briers collects stamps. I collect cars and guns, which are much more expensive, and much more difficult to store.","author":"Michael Gambon"},{"quote":"I always do like seeing other people dance in their cars. It's one of the things that makes me happy.","author":"Ariel Gore"},{"quote":"Environmentalists have a very conflicted relationship with their cars.","author":"Tom Arnold"},{"quote":"When I was four, I just wanted to drive, I collected toy cars. Where does that sort of thing come from? In hindsight you go, 'Oh, liked it because of this.' Maybe it's just the wheel.","author":"Michael Fassbender"},{"quote":"We're just into toys, whether it's motorcycles or race cars or computers. I've got the Palm Pilot right here with me, I've got the world's smallest phone. Maybe it's just because I'm still a big little kid and I just love toys, you know?","author":"Catherine Bell"},{"quote":"The format of the race weekend is also very well thought out. We have enough practice time to get the cars well set-up and have a proper qualifying session where we can do as many laps as we like, which is great for the drivers and spectators.","author":"Nigel Mansell"},{"quote":"I am a big car enthusiast. I totally understand guys like Jay Leno who have a thousand cars. But asking me my favorite car would be like asking my favorite song or favorite food - it changes everyday.","author":"Casey James"},{"quote":"I have about 40 cars, of which 25 to 30 are what you might call serious.","author":"Nick Mason"},{"quote":"Older cars tend to drive like older cars. That is not for me.","author":"Robert Herjavec"},{"quote":"The automobile, both a cause and an effect of this decentralization, is ideally suited for our vast landscape and our generally confused and contrary commuting patterns.","author":"Brock Yates"},{"quote":"Buyers of powerful cars place a high premium on the exhaust note, and manufacturers spend a lot of money getting it right. At the same time, high-end cars are expected to filter out the sounds of the mundane world.","author":"Serge Schmemann"},{"quote":"Germans make nice cars.","author":"Jason Behr"},{"quote":"I've got two old Volvos, two old Subarus, and an old Ford Ranger. If you've got an old car, you've gotta have at least several old cars, 'cause one's always gonna be in the garage.","author":"Rip Torn"},{"quote":"I was brought up in a car family, my dad loved cars and I was taught the art of making an Austin 7 operate.","author":"Nick Mason"},{"quote":"I drove 3,500 miles this summer on our family holiday, we drove across 10 countries. I have driven across the United States four times. I love cars, I love being in cars, I think so do most people. I want to help and support those people who have that same kind of enthusiasm for driving that I have.","author":"Geoff Hoon"},{"quote":"I've always had an inquisitive mind about everything from flowers to television sets to motor cars. Always pulled them apart - couldn't put 'em back, but always extremely interested in how things work.","author":"Craig Johnston"},{"quote":"I don't buy fur coats or jewelry. I have old cars.","author":"Peta Wilson"},{"quote":"Running on different types of racetracks is challenging - not only for the drivers, but even more for the team members who have to make adjustments to the cars before each race.","author":"Michael Andretti"},{"quote":"I ride many different cars. Let's say I would drive 200 different vehicles in a year, so it's rather difficult to say which car or what car I ride. I love cars.","author":"Akio Toyoda"},{"quote":"I think there's a suspicion in the South of people putting on airs. You see it in most successful Southern politicians, but you also see it in someone like Richard Petty, who may be a multimillionaire stock car driver, but he's also beloved because he has a nice self-deprecatory way about him.","author":"John Shelton Reed"},{"quote":"If I get into a car on a circuit, I drive as fast as I can; that's it!","author":"James Hunt"},{"quote":"I have one car that works; it's fast and safe: an Audi 5. And I have two old cars that never work: an old Peugeot convertible, and an Alfa Romeo Giulia.","author":"Daniel Bruhl"},{"quote":"I'm always in favor of more glamour. I embarrass my children, I think. I am the lady in feathers in the car pool line.","author":"Mia Sara"},{"quote":"My very first role was with James Earl Jones on 'Gabriel's Fire' on TV. He drove a Chevy Citation, which is the exact same car that I bought from a guy in San Francisco called Sandy Boone. I showed up on set, and James Earl Jones was driving the car I had bought from Sandy for $250.","author":"Leland Orser"},{"quote":"Driving with one foot on the accelerator and the other on the brake is likely to get you nowhere, but certainly will burn out vital parts of your car. Similarly, cutting taxes on the middle class, but increasing them on the 'rich' is likely to result in an economic burnout.","author":"Terry Savage"},{"quote":"I am very puzzled by the fact that young people are getting infected again. They don't take precautions despite an enormous amount of information. It's like riding a race car at 200 kilometers an hour. Some people like the risk.","author":"Luc Montagnier"},{"quote":"When I was 15, my parents left town for a month. They hid the keys to the car, but I found them. That month, I drove my stepdad's Thunderbird Super Coupe into Manhattan every day, and I would crank Cypress Hill as I flew around the city, racing the taxis.","author":"Danny Masterson"},{"quote":"I don't have kids, a mortgage, or a car. That has let me hold out for the jobs I want to do, and to sit in a cold room in the winter with fingerless gloves, writing.","author":"Alice Lowe"},{"quote":"I'm ashamed to say this, but I watched every episode of 'Starsky and Hutch' as a kid. I loved that show, but now I think it's stupid - they'd have a car chase for no reason, then Paul Michael Glaser would shoot the car and it would blow up.","author":"Shane Black"},{"quote":"I can't find my car keys in the morning. Trying to get out of my house is a nightmare. 'Where's my wallet? Where are my keys? I have to go find a missing person.'","author":"Anthony LaPaglia"},{"quote":"That was my pride and joy - that I made it through all those years of minor hockey without losing any of my teeth; then, I ended up losing them in a car accident in New York when I was riding in a taxi. So, I end up losing my teeth, but not in the glamorous fashion I envisioned.","author":"Tom Glavine"},{"quote":"I can't listen to music when I'm writing. I like music best in a car or on the train.","author":"Nell Freudenberger"},{"quote":"I am not only overwhelmed with excitement to be back in the seat but also to show my support to help raise awareness to end domestic violence and sexual assault by displaying the 'No More' symbol as I pilot the No. 24 car.","author":"Amber Cope"},{"quote":"My parents were mourning the death of my sister. She was killed in a car accident before I was born, and I didn't know she existed until I was 13 or 14 years old. I knew I was growing up in a house where people were angry and sad.","author":"Andrew Hudgins"},{"quote":"I look at the car park and myself and Dave Watson come in with our old cars, and these young lads come in with their new Porches. I think that society has changed, there seems to be a lack of respect nowadays.","author":"Richard Gough"},{"quote":"I'm fascinated by the narrative of geology, and I'm a veritable pack rat of a collector on the road. I keep a rock hammer in my car.","author":"Marianne Wiggins"},{"quote":"Every time I copy something, I can draw it for the rest of my life. But research is so painful - I mean just opening up a magazine looking for a picture of a car or looking out the window looking for a car is just hard!","author":"Jaime Hernandez"},{"quote":"I am training at such a high level that I actually could eat anything and get by. But as my coach always says, your body is like a car, and food is like your fuel. I am a race car, so I can't just put unleaded fuel in my car. I need that good premium fuel.","author":"Lolo Jones"},{"quote":"Getting ready to wrestle is like getting ready for a car crash. Getting ready to work with Brock Lesnar is like knowing you're going to get hit by a bus and the bus is going to back over you. If I'm going to work 'WrestleMania,' 16 weeks out I have to start training like I'm Mayweather getting ready for a fight.","author":"Triple H"},{"quote":"Short stories, for me, it's like you step inside this brand new car and you drive it and you drive it into a tree and you walk away from it.","author":"Kevin Wilson"},{"quote":"Basketball is what got me out of the projects. It got my momma the house she never had, the car she never had. Nobody is going to get the best of me. You might score more points than me, but you're going to know you were in a dogfight.","author":"Kenyon Martin"},{"quote":"I went from buying my own condominium and a car for myself when I was 17 on 'The Facts of Life' to not being able to pay my rent. I was at the unemployment office all the time. I had to sell my record collection just to make ends meet. And then I started getting these voice-over jobs.","author":"Pamela Adlon"},{"quote":"It's like, once you've seen Tom Hanks win the Golden Globes, the Oscars, you've seen his wife, what kind of car he drives, when you watch his movies, you can't fully get really lost in them.","author":"Justin Theroux"},{"quote":"He's computerized, but I won't let him come on cold. I created KITT. I understand the personality of the car.","author":"William Daniels"},{"quote":"We should be licensing everybody with a gun. I have to have a license for my dog. I have to have a license for my car. If you're going to do my hair later you have to have a license... We don't require a license to own a firearm?","author":"Michael Moore"},{"quote":"A while ago I said that, 'You know, I like a guy - he doesn't have to be all rich and famous - he can be normal.' And I remember I was walking in the mall, and this guy was like, 'Tyra, I'm normal. I live with my mama. I ain't got a car and I ain't got a job! I'm real normal.' And I'm like, 'That's not normal - that's a loser!'","author":"Tyra Banks"},{"quote":"A car is a 2,000 pound projectile that can go 100 miles an hour.","author":"Jesse Ventura"},{"quote":"I'm sort of like a lame, single guy in a red sports car.","author":"Billy Corgan"},{"quote":"I've loved car racing all my life. I watch NASCAR regularly, and drag racing because we have Raceway Park in New Jersey. I think I got it from my father.","author":"Queen Latifah"},{"quote":"Cars mean nothing to me. I'm not a car guy.","author":"Penn Jillette"},{"quote":"A Prius is not a true hybrid, really. The current Prius is, like, 2 percent electric. It's a gasoline car with slightly better mileage.","author":"Elon Musk"},{"quote":"Winning 'Motor Trend' Car of the year is probably the closest thing to winning the Oscar or Emmy of the car industry.","author":"Elon Musk"},{"quote":"I don't want to argue with my wife about her car - or my driving.","author":"Dale Earnhardt"},{"quote":"Am I a car aficionado? No: for me, cars have always been just for transport. I didn't even know anyone who had a car until I was 14 or 15.","author":"Michael Caine"},{"quote":"I love sleeping in a moving car more than sleeping in bed.","author":"Ben Stein"},{"quote":"I pay for homeowner's insurance, I pay for car insurance, I pay for health insurance.","author":"Elizabeth Warren"},{"quote":"You sell a screenplay like you sell a car. If someone drives it off a cliff, that's it.","author":"Rita Mae Brown"},{"quote":"People who have car collections - I never understood that. I always thought that was unnecessary. It's not beautiful, it's not creative. It's just showing how much money you've got.","author":"Daniel Radcliffe"},{"quote":"I think Tesla will most likely develop its own autopilot system for the car, as I think it should be camera-based, not Lidar-based. However, it is also possible that we do something jointly with Google.","author":"Elon Musk"},{"quote":"Sometimes I keep a car for only a week or two. I like the newest and the flashiest.","author":"Evel Knievel"},{"quote":"The creative process is mysterious; a conversation, a ride in the car, or a melody can trigger something.","author":"Alejandro Gonzalez Inarritu"},{"quote":"My first car, I got it in an auction at my temple. It was an '86 Volvo that I got for 500 bucks, and then wound up throwing $10,000 into the stereo system and put TVs in the foot rests. It was the most ridiculous Volvo you'd ever seen, but I had never had money before and I was out of my mind.","author":"Shia LaBeouf"},{"quote":"You can get into a very fancy car and know everything about the engine, but when you drive in that car, you feel that rush. In the same way, I think the more you know about love, the more you can enjoy it. And knowing about your personality type, who you are and what kind of person you're dealing with gives you a great leg up.","author":"Helen Fisher"},{"quote":"You can find out anything you want about a car now, and especially every bit of information about the price, without relying on the dealers.","author":"Susan Orlean"},{"quote":"I sing in the car if I'm in LA, because you're like soundproofed.","author":"Jimmy Fallon"},{"quote":"I would not advise people to buy a car or house without making a list. You will probably improve your intuitions by making a list and then sleeping on it.","author":"Daniel Kahneman"},{"quote":"Fortunately for me, I'm married to an amazing woman - Nancy Lasseter - who is wise enough not to let me buy every car I want. If I was single, I would be living in a very small apartment and renting a warehouse full of cool cars.","author":"John Lasseter"},{"quote":"I feel like so often I'm just, like, running around and eating in the car, which is, like, not good, or eating as I'm walking down the street.","author":"Gillian Jacobs"},{"quote":"Car love is the sound of a throaty V-8 rumbling and revving, the acceleration throwing you back in the seat - especially when you get on a beautiful, winding road and the light's dappling through the trees.","author":"John Lasseter"},{"quote":"I think you have to feel comfortable with your car. You have to go into turn one, every lap, with confidence. You have to be sure of yourself and your equipment.","author":"Danica Patrick"},{"quote":"Be able to back up a car for a considerable distance in a straight line and back out of a driveway.","author":"Marilyn vos Savant"},{"quote":"If I go onstage, I want to give people everything they want and more. I'll wash their car for them on their way out.","author":"Trent Reznor"},{"quote":"I'm probably more dangerous in a car than I am on a motorbike; on a bike I'm very mindful of the fact that if you make a mistake, you're dead.","author":"James McAvoy"},{"quote":"The greatest luxury is not driving. I didn't own a car until I was 30, and that was a Rolls-Royce, so it was cheaper to insure a chauffeur. I never want to drive again. My mind is always on other things. I hate parking, and I'm very short-tempered and would get road rage, I'm sure.","author":"Michael Caine"},{"quote":"It is definitely true that the fundamental enabling technology for electric cars is lithium-ion as a cell chemistry technology. In the absence of that, I don't think it's possible to make an electric car that is competitive with a gasoline car.","author":"Elon Musk"},{"quote":"I didn't come from a trailer park. I grew up middle class and my dad had money and my mom made my lunch. I got a car when I was sixteen. I'm proud of that.","author":"Kid Rock"},{"quote":"The only magazines I read are car magazines.","author":"Simon Cowell"},{"quote":"'Cars' is a really personal story for me because, first of all, I grew up in Los Angeles - the car crazy capital.","author":"John Lasseter"},{"quote":"Even in the limo, I buckle my seatbelt. I got that seatbelt on before the car moves.","author":"Christopher Walken"},{"quote":"We could definitely make a flying car - but that's not the hard part. The hard part is, how do you make a flying car that's super safe and quiet? Because if it's a howler, you're going to make people very unhappy.","author":"Elon Musk"},{"quote":"I have a car but it's not important.","author":"Eric Cantona"},{"quote":"You can know or not know how a car runs and still enjoy riding in a car.","author":"David Byrne"},{"quote":"I'm a car nut. My father was a parts manager at a Chevrolet dealership.","author":"John Lasseter"},{"quote":"'Amores Perros' is three stories that interconnect in one moment, which is the car accident.","author":"Alejandro Gonzalez Inarritu"},{"quote":"I once went to one of those parties where everyone throws their car keys into the middle of the room. I don't know who got my moped, but I drove that Peugeot for years.","author":"Victoria Wood"},{"quote":"I do find it amusing when somebody cuts me off, makes an aggressive move on me in a car. I'm like, 'Do you have any idea what I do for a living? Why?'","author":"Jimmie Johnson"},{"quote":"I probably wouldn't be a good spokesman for an electric car, because I'll still get on a private jet, and one flight on a private jet undoes all my electric-car good deeds.","author":"George Clooney"},{"quote":"When I was a kid, nobody in my family had a car. And I didn't have many toys. The only toys I had were the ones I would steal.","author":"DMX"},{"quote":"It's so funny looking back, but my so-called overnight success actually took 15 years. I remember when I didn't have any money, and my only car was mom's Hyundai.","author":"Criss Angel"},{"quote":"At least 50 times. I've jumped off a building, jumped off a cliff in a car. I've been in bedrooms when women came in with knives and guns.","author":"Dennis Rodman"},{"quote":"I did not want to spend the rest of my life not being able to ride in a nice car.","author":"Shakira"},{"quote":"Yes, I did and a lot of my friends who are in the same program as I were very much supportive, and the most important thing they said to me is do not let this interfere with what you have to do in taking car of yourself. That was the most important thing.","author":"Naomi Campbell"},{"quote":"I think I'm actually quite a materialistic person, I value what it takes to make a car or build a nice house. Money does change things, but how it changes people depends on how they react to it.","author":"Roland Gift"},{"quote":"It just seemed too weird to me. I don't know, maybe they were smoking a joint in the car downstairs from their parents' apartment. I had to go that far to put together a scenario of how they could have possibly recognized me.","author":"Marc Jacobs"},{"quote":"Unlike fuel-economy standards, the most common method of reducing demand for oil over the past thirty years, a gas tax doesn't tell people what kind of car to drive. It simply raises the price of gasoline and lets people adjust their behavior accordingly.","author":"James Surowiecki"},{"quote":"I drive the same car that I've driven since I was 16. That's who I am.","author":"Selena Gomez"},{"quote":"My first car was in 2006 when I got on my first TV show - a BMW 328i2 four-door sedan in slate grey. That was a great day, that was.","author":"Rebecca Mader"},{"quote":"Acting advice is a bit like your parents teaching you how to drive a car. You know they're right, but you still kind of want them to shut up a bit.","author":"Max Irons"},{"quote":"Besides my son, music is the most important thing to me. I always have music on in my car and playing at house, and I'm in the studio or performing every night. I like Beats by Dre for headphones, and Bang & Olufsen soundsystems.","author":"French Montana"},{"quote":"The red carpet is kind of a surreal experience. There's nothing normal about it, so for me the most important thing is to maintain some normality right until the point you get out of the car.","author":"Samantha Barks"},{"quote":"You get around people who see us away from the track, and it's a pretty big contrast. You're still competitive, and you still want to win everything, but I think in the car, we're focused and passionate all the time. We get outside the car, and we're a lot more relaxed and easygoing, enjoying things away from racing.","author":"Tony Stewart"},{"quote":"My engineer dad is where my technical acumen comes from. I remember him taking me to the factories to see how what works. Often he used to open up his motorbike to fix things and I saw how the wheels worked. His car used to be open for dissection very regularly. All this taught me and inspired me to look beyond what I could see on the skin.","author":"Bibhu Mohapatra"},{"quote":"Ferrari used to be the car that you kept in your garage, took out to polish and show, and put back into the garage.","author":"Luca Cordero di Montezemolo"},{"quote":"When you're in your 20s, you're a little more carefree; you're single. You have a very different way of looking at the world and experiencing the world. But later in your 30s, when you have children, a career, career obstacles, mortgages, car payments and relationships, you have to negotiate; that's a very different life.","author":"Melissa De Sousa"},{"quote":"I'm like, 'Would you be the person in the room that would boo when Dylan went electric? I know I wouldn't. Or are you the person that left The Beatles after 'She Loves You,' or 'Drive My Car?' You weren't on board for 'Revolution 9' or 'Day In The Life,' were you?'","author":"Regina Spektor"},{"quote":"Since I was kid, what's drawn me to racing is the feeling inside of me, the passion I have for the sport, the feeling I have while competing and doing what I do in a car, on a bike, whatever it's been.","author":"Jimmie Johnson"},{"quote":"So if you're a robot and you're living on this planet, you can do things that you can't do in real life - things that you wished you could do: like fly; like have a car that flies; like have furniture that is alive.","author":"William Joyce"},{"quote":"The fact is I like Mumbai less and less. My son says, 'Baba, let's go for a drive', and I tell him, 'Where's the fun of a drive in this place?' You get caught in a million traffic jams, and you spend time cooped in your car with all that mad cacophony around you.","author":"Om Puri"},{"quote":"No, in Lethal Weapon I was a taxi cab driver that Mel jumps in front of the taxi and pulls me out of the car and steals the taxi. Then I did some other indie driving for some of the car sequences.","author":"David R. Ellis"},{"quote":"I love doing all of my own stunts. Anything. Even if they are telling me, 'No, no, no! You can't do that!' I'll do it. Like crashing my car through the gate, climbing up the building, kicking in a window... I love doing all of that stuff.","author":"Christa Campbell"},{"quote":"YI teamed up with the Allstate Foundation to basically inform teens why it's important to drive safe. I feel I'm new on the road, so it's important to do these three main things: The first one is buckle up, the second one is slow down, don't speed, and the third one is don't let your friends distract you in the car.","author":"Austin Mahone"},{"quote":"People generally complain that they're overburdened by responsibilities, forgetting that they chose to have those responsibilities. No one makes you work like a dog in order to live in a nice house, put your kids in nice schools, drive a smart car and go on exotic foreign holidays. It's up to you.","author":"Mark Barrowcliffe"},{"quote":"When you're in a rehearsal room, it's like getting into a car and going on a long journey with everyone's stuff in the back. If you keep stopping the car and going, 'Are you sure we want to go?' and think, 'This is really daunting,' you will get frightened, so you just have to keep ploughing through it.","author":"Kate Fleetwood"},{"quote":"I have very long legs and I hate driving anything unless it's a boat or an ATV in the jungle. I like to sit in the back of a car, where I can look out the window, answer my emails on my iPad, or hold hands with a pretty girl.","author":"Jean Pigozzi"},{"quote":"I think I'm pretty smart on what I spend my money on. I still don't have a new car, I drive my old car that I've had forever. But I bought a house in downtown Chicago.","author":"Chris O'Donnell"},{"quote":"I don't act because I love doing it, I act because it's my job. At the end of the year, I gotta pay my taxes, bills, doctors, insurance, car insurance, the occasional vacation. It's a wonderful job. The upside is that it is exciting and different... the downside is that it is an extremely insecure job.","author":"Clint Howard"},{"quote":"You have to visualize a second or two ahead of your car what line you are taking, what you are going to do, before you get there because it comes too fast.","author":"Emerson Fittipaldi"},{"quote":"As far as luxury goes, about the only thing I do is... I go first class all the way. I live on the road, so when I'm out there, I'm getting the nice hotel suite, I'm getting the luxury car, I'm eating the good food, and I make sure I take care of myself on the road.","author":"Trish Stratus"},{"quote":"I did archery when I was in high school. In our gym class we had two weeks of archery, and I remember taking the bow and arrow and firing it up and across the street into a car parking lot.","author":"John Barrowman"},{"quote":"The alarm rings 4:45, again at 5, but I wake up 4:30 naturally. Shower, shave, orange juice, perk my own coffee, hear the news, and the CBS car arrives 5:30.","author":"Charlie Rose"},{"quote":"I don't even possess a car. I ride in auto-rickshaws because I like to be a part of the masses. I don't want to single myself out as someone up and above.","author":"Shakuntala Devi"},{"quote":"Growing up in the Midwest, people don't drive Porsches and Ferraris. They drive Fords and Chevys. And so even if you have the opportunity to buy a more expensive car, it doesn't occur to you because it's not what you relate to.","author":"Luke Perry"},{"quote":"I think we built the right future. If it's a choice between the flying car or the Internet, tablets and smartphones, I'll take what we've got.","author":"David Gerrold"},{"quote":"I've got a nice car. I love my job. I've got a bagel store, and I have breakfast every morning with friends I grew up with. I've been in movies, I've written books - I don't know how that all happened.","author":"Larry King"},{"quote":"I love to drive. My present to myself from 'The Tudors' was a red Mazda MX5 hard-top convertible. I loved that car, and also what she represented - my first success.","author":"Natalie Dormer"},{"quote":"Sometimes, when my wife and I were going out to dinner, I would take my laptop with me and work in the car, so as to take advantage of the half hour going and coming.","author":"Thomas Friedman"},{"quote":"Politicians don't like to face unpleasant realities. In truth, nobody does, but as individuals, we have no choice; if we neglect to plan ahead, we are held accountable. Fail to meet your responsibilities at work, and you get fired. Ignore your car's gas gauge, and you get stranded.","author":"Nathan Myhrvold"},{"quote":"In 2010, I sold my car, a Toyota Majester, for just a lakh-and-a-half to be able to feed my horses. It continues to be like a hole, where I put all my money.","author":"Randeep Hooda"},{"quote":"My first car was a Toyota 4Runner when I was 17. I paid for it myself. I was very happy.","author":"Apolo Ohno"},{"quote":"There are certain times I don't want my picture taken. If my wife's stepping out of a car and it looks like it's going to come out an indecent picture, don't I have a right to object?","author":"Bobby Darin"},{"quote":"I just want real creative freedom without worrying about, you know, car payments.","author":"Sean Penn"},{"quote":"The parents of teenagers would love to have a car that won't go very far or go very fast. They could just cruise around the neighborhood, drive it to school, see their friends, plug it in overnight.","author":"Clayton Christensen"},{"quote":"Food is not just what we put in our mouths to fill up; it is culture and identity. Reason plays some role in our decisions about food, but it's rarely driving the car.","author":"Jonathan Safran Foer"},{"quote":"When cars honk and hoot and drunks squeeze out of car windows and scream, you can be sure that football is in the air.","author":"Craig Brown"},{"quote":"My buildings are not particularly expensive. It is not a tin shed. If you want a tinny car, you pay for that.","author":"Zaha Hadid"},{"quote":"I still think I'm like the poor girl from Colorado who worked three jobs to buy a car. That's still my mentality, so I'll be walking down the street, and I forget what I do and who I am.","author":"Amy Adams"},{"quote":"I have been in Formula One for 12 years, and out of that I had one year with the perfect car.","author":"Michael Schumacher"},{"quote":"I'd kind of like to have a classic old muscle car. I think that would be fun.","author":"Brooke Burke"},{"quote":"I know I will die in a car crash.","author":"Katie Price"},{"quote":"I drank a lot when I was a teenager and I don't drink any more, because that's when I thought, you know, I'm gonna end up a car wreck.","author":"Kristin Davis"},{"quote":"I never thought being the producer was being the dictator. It means being the director and being the coach. It's a way of keeping everybody focused on the goal, and also having final say. Everybody can be in the same car, but somebody has to drive.","author":"Paul Stanley"},{"quote":"I've already established my (political)machinery. It's like a car. It's fixed already. You just have to get in and drive it.","author":"Manny Pacquiao"},{"quote":"I've always been a bit of a car freak.","author":"Eric Bana"},{"quote":"There are writers, and I know some of them, who are very disciplined. Who write, like, four pages a day, every day. And it doesn't matter if their dog got run over by a car that day, or they won the Irish sweepstakes. I'm not one of those writers.","author":"George R. R. Martin"},{"quote":"Johnny Guitar... just one of my favorite singers of all time. I met him when we were both on the road with Johnny Otis in the '50s when I was a teenager. We traveled the country in a car together. I would hear him sing every night.","author":"Etta James"},{"quote":"Someday we'll look back on this moment and plow into a parked car.","author":"Evan Davis"},{"quote":"As a child, I did what any normal kid who grew up without any electricity would do - I spent countless hours working on a computer wired to my parents' car battery... and learned how to code. This natural passion for computers lead me into the Internet market during the late 1990s and early 2000s.","author":"Ryan Holmes"},{"quote":"I'm still that little girl who lisped and sat in the back of the car and threw vegetables at the back of her head when we drove home from the market. That never goes.","author":"Tracey Ullman"},{"quote":"My original aim after 'The X Factor' was to earn enough money in a year to make the whole experience worth it - you know, buy a car, a flat.","author":"Olly Murs"},{"quote":"I'm sure there are close calls that we're not even aware of hundreds of times a year. You cross the street, and if you'd crossed the street two minutes later, you'd have been hit by a car, but you'd never know it. I'm sure that kind of stuff happens all the time.","author":"Seth MacFarlane"},{"quote":"I'm lucky because my dad taught me to be frugal and save. And that's important because I want to know that I don't have to take an acting job for two or three years if I don't want to and that I'll still be able to make my house and car payments and buy food for my dogs.","author":"Ashley Greene"},{"quote":"Sacrifice counts for a lot in sport. From a young age, I couldn't do the normal things that the boys of my age get to do. Maybe you have a nice car or a nice house, but at times you just want to be a normal guy and you can't.","author":"Mario Balotelli"},{"quote":"Over my lifetime, the car had actually transcended the fact that it is a car. It has become a venue.","author":"Eric Bana"},{"quote":"When I was a kid I got busted for throwing a rock through a car window and egging a house on halloween.","author":"Gavin DeGraw"},{"quote":"Especially in the car ride to and from gym. I find myself spacing out a lot, just visualizing what the Olympics would be like and just having such great role models.","author":"Aly Raisman"},{"quote":"Being a pedestrian again is very exciting because in L.A. you live in your car, and you're on a freeway all the time.","author":"Nicole Ari Parker"},{"quote":"My first car was a 1999 red Mazda Protege.","author":"Ike Barinholtz"},{"quote":"I am so pathetic with machines in real life, it's not a joke. I'd rather walk, or even run, than take the car out myself. I like to be driven around. Yes, I like fancy cars, and fancy bikes, too. It's my dream to learn how to ride one myself, but for now, I am content being driven around.","author":"Bipasha Basu"},{"quote":"I arrived in California with no job, no car, and no money, but, like millions of other girls, a dream.","author":"Victoria Principal"},{"quote":"I am 'Mr. Karaoke Guy' in the car completely. I just go with it and don't care what anyone else thinks - I'm singing, man!","author":"Drake Bell"},{"quote":"It sounds like something from a Woody Guthrie song, but it's true; I was raised in a freight car.","author":"Merle Haggard"},{"quote":"I used to do films for money earlier. I never knew what perception meant. I didn't give too much attention to scripts. It was either to buy a house or to buy a car. There was a certain frivolity to the way I used to pick up things. I wasn't taking my career seriously.","author":"Emraan Hashmi"},{"quote":"McDonald's revolutionized fast food. They introduced a way to eat food without knives, forks or plates. Most fast foods can be eaten while steering the wheel of a car and the restaurants are usually drive through.","author":"Eric Schlosser"},{"quote":"With all the hybrid stuff and things like that, I think that's a fabulous direction to go with cars in that sense. As someone who grew up around muscle cars, I'll never not be able to not love a muscle car. Not that I don't care about the environment, that's not it. But I adore muscle cars.","author":"Michael Symon"},{"quote":"When our markets work, people throughout our economy benefit - Americans seeking to buy a car or buy a home, families borrowing to pay for college, innovators borrowing on the strength of a good idea for a new product or technology, and businesses financing investments that create new jobs.","author":"Henry Paulson"},{"quote":"I lived in small town out in the desert and my friend used to steal his mom's car in the middle of the night. He'd drive over to my house, I'd sneak out and we'd go out to the desert and just burn things down.","author":"Mark Hoppus"},{"quote":"I am a horrible visual artist. I can't fix a car, sew, knit, cook, etc. Statistically, there is more I don't do than do.","author":"Carrie Brownstein"},{"quote":"Ninety-eight percent of the singing I did was private singing - it was in the shower, at the dishwasher, driving my car, singing with the radio, whatever. I can't do any of that now. I wish I could. I don't miss performing, particularly, but I miss singing.","author":"Linda Ronstadt"},{"quote":"I'm constantly saying that I have bad hair days when I'm in New York. It's so hard. I've been lucky enough to jump immediately into a car, head straight to the location, and stay in the air-conditioning.","author":"Christina Hendricks"},{"quote":"Megaupload was a dual-use technology. You can use it for good things, and you can use it for bad things. If someone sends something illegal in an envelope through your postal service, you don't shut down the post office. If someone speeds with the car he just bought, you don't go to the car manufacturer and say, 'Hey, we're shutting you down.'","author":"Kim Dotcom"},{"quote":"I don't want a flashy car, just something that would allow me to stop using the Tube. And it would be good not to have to rely on my mum all the time, particularly when I have to listen to her singing in her car.","author":"Andy Murray"},{"quote":"Growing up in Southern California, it's all car culture. When I was a kid, I knew every single model of every single car dealer; I knew every style of every year.","author":"Cheech Marin"},{"quote":"A lot of money eliminates a category of worry. If your car breaks down, you're still going to get through the day. But it doesn't make you a happy person if you weren't a happy person before.","author":"Gary David Goldberg"},{"quote":"My sense of injustice about our family's 'weirdness' in not owning a car was amplified by the fact that we did not own a television, either - my parents were unapologetic about this and told me very cheerfully that I would thank them for it when I was older, which was quite true.","author":"Eleanor Catton"},{"quote":"If you've got a plot the size of a car or a tiny yard in Italy, you're going to be growing tomatoes and basil and celery and carrots, and everybody is still connected to the land.","author":"Frances Mayes"},{"quote":"My dad was a physician. As a kid, I remember driving around with him on weekends so he could do his rounds at the hospital and talk to patients. We'd spend time in the car talking about what was going on with them, their stories.","author":"Pierre Omidyar"},{"quote":"When I do a T.V. show, I hear all these artists in their dressing rooms doing scales - I've never done it because I've never had voice training. What I do to prepare is get in my car and sing along to the radio for about 20 minutes.","author":"Bonnie Tyler"},{"quote":"When you're young, you need to be silly and be stupid and not be trying to do that when you're 40 in a red sports car.","author":"Gin Wigmore"},{"quote":"L.A. has a fantastic car scene and because the climate is so gentle, cars can last forever.","author":"Lee Child"},{"quote":"I took guitar a while back, and my heart wasn't in it at the time, but I'm ready to try it again. I sing in the car, at home - it's a huge part of my life, especially since I'm from Tennessee.","author":"Lucy Hale"},{"quote":"Bond doesn't have an inner life. There would be moments when I'd think, 'We need to gather our thoughts here and have a breather,' where in another novel you'd slow the pace, have some description and see what Bond feels about this. But Bond doesn't reflect. All you can do is move on to the next bomb or shark or car.","author":"Sebastian Faulks"},{"quote":"As soon as I began to earn what might be called fairly large sums, I bought a car and began to explore the country around New York.","author":"Kate Smith"},{"quote":"Driving will never be away from me - I can't just give it up. It's all I've ever done, and there's something about being in that car.","author":"Jimmie Johnson"},{"quote":"You don't have control of the car, but you can drive it. Life takes you where it wants you to go and where you need to go.","author":"Art Alexakis"},{"quote":"The driver of a racing car is a component. When I first began, I used to grip the steering wheel firmly, and I changed gear so hard that I damaged my hand.","author":"Juan Manuel Fangio"},{"quote":"A man from a primitive culture who sees an automobile might guess that it was powered by the wind or by an antelope hidden under the car, but when he opens up the hood and sees the engine he immediately realizes that it was designed.","author":"Michael Behe"},{"quote":"Cotton Owens was leading and daddy was second. They came up on me and I moved over to let them pass. Cotton went on, but daddy bumped me in the rear and my car went right into the wall.","author":"Richard Petty"},{"quote":"A human being is still more likely to die of a bee sting, snake bite or, Lord knows, automobile accident than by shark attack. We do not execute the perpretrators of death by car. We should not butcher an animal for an inadvertent homicide.","author":"Peter Benchley"},{"quote":"I've done maybe twelve of Shakespeare's plays. I was with the Royal Shakespeare Company for years. Whatever influence that has never leaves you. If you learn to drive a car, and you learn the right way if there is ever a right way. You learn the good aspects, you learn to drive properly. And that never leaves you.","author":"Charles Dance"},{"quote":"So, I remember when I was a kid, I was waiting for my mom to come home when she was working late, and, you know, I was like, 'Oh my God, what happened to her? Is she OK? Did something happen to her getting in the car?' I was a little kid. But those are actually early onsets of anxiety.","author":"Vinny Guadagnino"},{"quote":"Self-driving cars will enable car-sharing even in spread-out suburbs. A car will come to you just when you need it. And when you are done with it, the car will just drive away, so you won't even have to look for parking.","author":"Sebastian Thrun"},{"quote":"I married a pretty famous girl, and when we drive through town there's usually a car following us, when I walk out of my front door in Chelsea there's six guys waiting for me.","author":"Kevin Pietersen"},{"quote":"I mostly drive around in a Fiat 500 TwinAir, and that's a pretty small car!","author":"Richard Hammond"},{"quote":"You don't want to engage in road rage when the person in the next car might be your child's future teacher or your dentist's father.","author":"Kim Edwards"},{"quote":"Hospital-acquired infections are now killing more people every year in the United States than die from AIDS or cancer or car accidents combined - about 100,000.","author":"Janine Benyus"},{"quote":"When I'm doing kitchen planning as well as bathroom design, I try to walk through the day with the homeowner. If we're talking about a kitchen, it will be: So, we are walking in with the groceries. When we are taking them out of the car, where will they go? What is the distance to fridge, to pantry?","author":"Candice Olson"},{"quote":"The keyboard is my whole life. My life is centered around either sitting at my keyboard or driving my car. Those are the two most important things, more than anything else. Being at my keyboard, it's the happiest time for me.","author":"Brian Wilson"},{"quote":"Man, coaching is a hard job, and it requires a lot of time... I hear stories from coaches who tell me that players call them in the middle of the night not knowing where they parked their car. You are baby-sitting rich, spoiled kids... I don't know where you parked your car!","author":"Joe Montana"},{"quote":"There is no secret, once we go to qualifying, we all seem to enjoy it. Qualifying is all about putting everything that you have and that the car has in one lap. It's like a rush, I really enjoy that.","author":"Sebastian Vettel"},{"quote":"The challenge in most car chases is you're trying to hide the fact that it's not the actor driving.","author":"Christopher McQuarrie"},{"quote":"I was so wild and crazy and dumb in my car. It didn't run but 30 miles an hour. You made do.","author":"Muddy Waters"},{"quote":"If one's honest about it, spending time in a car with children is pretty ghastly.","author":"Arabella Weir"},{"quote":"I'd like to have the flying car, I think that'd be really cool.","author":"Rupert Grint"},{"quote":"My dirty little secret is I don't drive at all, though I have my license and I renew it every five years. I'm phobic. I keep worrying if I drive, I'll end up killing someone. I hoped that by writing about a car crash, I might understand and heal this phobia, but I didn't! I'm still phobic.","author":"Caroline Leavitt"},{"quote":"You cannot expect the guy who drove the car into the ditch to navigate it out of the ditch. You have to put a new driver in the seat. I'm not saying the new driver is going to be any better, but we need a new driver. Kerry is the only choice.","author":"John Mellencamp"},{"quote":"Racing a thoroughbred grand prix car in front of a home crowd will be a surreal and mighty experience.","author":"Nigel Mansell"},{"quote":"Natural DNA is a tractless coil, like an unwound and tangled audiotape on the floor of the car in the dark.","author":"Kary Mullis"},{"quote":"I haven't got a car or a house. I've got a wife, but I didn't pay for her! I spend all my money on my glorious wife. She's here with a knife at my throat!","author":"Mackenzie Crook"},{"quote":"In L.A., I don't really want to go out because traffic sucks so bad. I'm sorry, I'm not going to spend five hours a day in my car, so you have to choose where you live very carefully.","author":"Holly Madison"},{"quote":"I always try to say, 'If you want to help the environment, try to do just two things. One, use less of your car. Second, separate your garbage.'","author":"Jaime Lerner"},{"quote":"A car to pick me up every day, a chair with my name on it, everybody being very polite... what can you do except sit back and watch it all, try to take it all in?","author":"Charles Dance"},{"quote":"Television is such an evolving medium. When you're doing a TV show, it's not like you just shoot for six weeks and you're in an editing room with all of your footage. It's like a guitar or a car, you have to fine tune things. You stop doing what's not working, you work on what is working and you add things that do work.","author":"Chris Pratt"}]